[{"model": "core.membro", "pk": 1, "fields": {"password": "pbkdf2_sha256$870000$ZnYpZcgXSclvNVt3VpEsum$IcbMNFVOJa/UB92YMeG0OG2j+OiMmMc3cgi0goFqEI0=", "last_login": "2025-02-11T20:53:22.696Z", "first_name": "Marcos", "last_name": "Glasner", "membro": "Curio5813", "email": "marcosglasner@gmail.com", "nascimento": "1977-10-20", "bio": "\"Passionate about technology and computer games, always exploring the latest in digital advancements and nostalgic gaming experiences.\"", "genero": "M", "imagem": "acaf0838-117a-4bf8-8f0f-8a17fea21c35.jpg", "ativo": true, "modificado": "2025-01-27T18:57:47.970Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 2, "fields": {"password": "curio5813#$", "last_login": null, "first_name": "Brad", "last_name": "Pitt", "membro": "brad22", "email": "brad@gmail.com", "nascimento": "1977-10-20", "bio": null, "genero": "M", "imagem": "91eaa904-340b-4733-9c75-d08388e48390.jpg", "ativo": true, "modificado": "2024-10-10T23:53:19.948Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 3, "fields": {"password": "curio5813#$", "last_login": null, "first_name": "Paula", "last_name": "Fernandez", "membro": "Paulinha", "email": "paula@gmail.com", "nascimento": "1987-12-01", "bio": null, "genero": "F", "imagem": "5fd19be2-46ee-4c60-a38a-1bd338f133f0.jpg", "ativo": true, "modificado": "2024-10-07T00:00:00Z", "is_staff": false, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 4, "fields": {"password": "curio5813#$", "last_login": null, "first_name": "Paul", "last_name": "Allen", "membro": "beatles", "email": "allen@gmail.com", "nascimento": "1953-02-17", "bio": null, "genero": "M", "imagem": "38f11f38-9e77-475a-9596-b59cbd36d567.jpg", "ativo": true, "modificado": "2024-10-07T00:00:00Z", "is_staff": false, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 5, "fields": {"password": "pbkdf2_sha256$870000$h0VN3chc66DjG6gMaDUsix$/oqyNjVaKcN9UcO1IMq5lhBFgpZtv86Eq601P2EhDSQ=", "last_login": "2025-02-11T20:52:49.518Z", "first_name": "Angelina", "last_name": "Jolie", "membro": "tomraider", "email": "angelina@gmail.com", "nascimento": "1987-12-01", "bio": null, "genero": "F", "imagem": "e06c235c-e325-4687-95f4-08aa61c41030.jpg", "ativo": true, "modificado": "2024-10-15T06:49:39.109Z", "is_staff": true, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 6, "fields": {"password": "pbkdf2_sha256$870000$jlfbQqqGOR4s3lK5Rn9tGx$Dd8Zu/muDi3xYmDTW1eB30kME/00oXDxwLAT9s0V2Zs=", "last_login": "2025-02-11T20:44:19.676Z", "first_name": "Bill", "last_name": "Gates", "membro": "geek", "email": "gates@gmail.com", "nascimento": "1951-02-15", "bio": "", "genero": "M", "imagem": "61d97aff-ba64-4267-8796-401491bc18a4.jpg", "ativo": true, "modificado": "2025-01-27T13:02:39.617Z", "is_staff": false, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 10, "fields": {"password": "pbkdf2_sha256$870000$KL5LnkixbgZi3tttUIlOUD$9PSITLlwFl0qEoanENzti0TS/2FgomC9LLBiNwzSHR0=", "last_login": "2025-02-11T18:19:21.120Z", "first_name": "Marcos", "last_name": "Glasner", "membro": "Sabia5813", "email": "marcosglasner5813@gmail.com", "nascimento": "1977-10-20", "bio": null, "genero": "M", "imagem": "917ef5fc-ec20-44e0-977f-bc74ff2ce835.jpg", "ativo": true, "modificado": "2024-10-10T03:22:07.327Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 11, "fields": {"password": "pbkdf2_sha256$870000$lUy1wQABCZ2jhW0z2lDtff$54wYStaH+G47GU7/2vYXFmjbGQC1r5lQmONIM4wQQXw=", "last_login": "2024-10-11T03:44:44Z", "first_name": "Steve", "last_name": "Jobs", "membro": "Apple", "email": "jobs@gmail.com", "nascimento": "1951-10-11", "bio": "", "genero": "M", "imagem": "9456a8ab-15ca-4fcd-9d32-6223c15e11ef.jpg", "ativo": true, "modificado": "2025-01-28T08:53:46.448Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 12, "fields": {"password": "pbkdf2_sha256$870000$s85Rbe7TyVpsWfNBs1zQcD$yHmjOkoDXfosu+FWVVpfww6fdlC1cweJn5vVyhLcVkQ=", "last_login": "2025-02-11T18:39:29.925Z", "first_name": "Frooger", "last_name": "Stanislaw", "membro": "fogg", "email": "foog@gmail.com", "nascimento": "1982-03-13", "bio": "I am passionate about computer games. Since my teenage years, I have been playing computer games, and it was during that time that I started to develop an interest in technology.", "genero": "M", "imagem": "0b0746bd-67c4-41b6-ac21-de1d2539cd24.jpg", "ativo": true, "modificado": "2025-02-03T19:15:26.340Z", "is_staff": true, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 13, "fields": {"password": "pbkdf2_sha256$870000$KEp8isPllGxcgpE4Gd6lht$DmR2T0bTKd+fsqY5IdopAfpHmJw59nw/Ur6rKVYmPiM=", "last_login": "2025-02-11T20:51:58.733Z", "first_name": "Luiz", "last_name": "Gonzaga", "membro": "AsaBranca", "email": "asabranca@gmail.com", "nascimento": "1945-03-23", "bio": "", "genero": "M", "imagem": "a2e981ec-13fa-4648-b724-6673759bda29.jpg", "ativo": true, "modificado": "2025-01-28T08:54:20.830Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 14, "fields": {"password": "pbkdf2_sha256$870000$sXiTKZiNB8tqGYCrHLHG7c$Yw6lgshE8OB0p8nN9X74Q/6lujNOINq6LJux5lwGYWs=", "last_login": "2025-02-10T08:04:34.726Z", "first_name": "Valquiria", "last_name": "Wagner", "membro": "Amazon", "email": "amazonia@gmail.com", "nascimento": "1837-10-13", "bio": "Old-school gaming enthusiast who’s journeyed through every pixel and polygon! From epic RPGs to adrenaline-pumping shooters, I thrive on the nostalgia of classics across every genre.", "genero": "M", "imagem": "c225fc2a-acd2-4bbb-a770-d702aa2913bc.jpg", "ativo": true, "modificado": "2025-01-27T13:00:08.724Z", "is_staff": false, "is_superuser": false, "groups": [], "user_permissions": []}}, {"model": "core.membro", "pk": 16, "fields": {"password": "pbkdf2_sha256$870000$CwyjO17uObUtR8aJjQjH0B$nMfKoXnW4JYoWntdl99893y7zPzu2iWKz76UHwR+jWA=", "last_login": null, "first_name": "marcos", "last_name": "glasner", "membro": "", "email": "marcosglasner@hotmail.com", "nascimento": null, "bio": null, "genero": "", "imagem": "", "ativo": true, "modificado": "2025-02-12T13:14:18.558Z", "is_staff": true, "is_superuser": true, "groups": [], "user_permissions": []}}, {"model": "core.genero", "pk": 1, "fields": {"nome": "Action"}}, {"model": "core.genero", "pk": 2, "fields": {"nome": "Adventure"}}, {"model": "core.genero", "pk": 3, "fields": {"nome": "Puzzle"}}, {"model": "core.genero", "pk": 4, "fields": {"nome": "Racing"}}, {"model": "core.genero", "pk": 5, "fields": {"nome": "RPG"}}, {"model": "core.genero", "pk": 6, "fields": {"nome": "Shooter"}}, {"model": "core.genero", "pk": 7, "fields": {"nome": "Simulation"}}, {"model": "core.genero", "pk": 8, "fields": {"nome": "Sports"}}, {"model": "core.genero", "pk": 9, "fields": {"nome": "Strategy"}}, {"model": "core.games", "pk": 1, "fields": {"criado": "2024-10-06", "modificado": "2024-11-30", "ativo": true, "game": "Doom", "descricao": "Released by id Software in 1993, Doom is one of the most influential first-person shooters ever made, defining the genre and inspiring countless games to follow. As the unnamed space marine, or \"Doomguy,\" players battle hordes of demons and undead on the Martian moons of Phobos and Deimos. Doom takes players through dark, labyrinthine levels filled with enemies, secrets, and plenty of fast-paced action. Its mix of adrenaline-fueled gameplay, intense atmosphere, and revolutionary design made Doom a landmark in gaming history that remains iconic to this day.", "gameplay": "Doom’s gameplay is simple yet addictive. With a focus on speed, reflexes, and skillful shooting, the game keeps players constantly moving to dodge attacks and find the best angles to eliminate enemies. The arsenal, while small by today’s standards, includes a satisfying selection of weapons like the shotgun, chainsaw, and the iconic BFG 9000. Each weapon feels powerful and offers different strategic uses, essential in dealing with Doom’s challenging enemies, from imps and pinky demons to the formidable barons of hell. Doom also introduced the idea of keycard hunting and maze-like level design, requiring players to think on their feet and strategize as they fight through each level. Multiplayer deathmatches, though limited to local connections, became immensely popular and laid the foundation for competitive FPS gaming.", "graphics": "For its time, Doom’s graphics were groundbreaking, using a pseudo-3D engine that created the illusion of depth and space. While not fully 3D, the game’s environments and enemies are highly detailed and atmospheric, using lighting and color to add tension to each level. The textures, often bloodstained and worn, add to the game’s gritty, hellish atmosphere. Though primitive by today’s standards, Doom’s visual style is timeless, with memorable level designs and an aesthetic that still holds up in retro gaming circles.", "sound_and_music": "The sound and music in Doom play a vital role in creating its intense atmosphere. The soundtrack, composed by Bobby Prince, mixes heavy metal-inspired tracks with eerie ambient sounds that perfectly capture the game’s sense of relentless action and horror. Tracks like “At Doom’s Gate” have become iconic, adding to the adrenaline rush of each encounter. The sound effects, from the growls and roars of demons to the booming gunfire, are satisfying and distinct, enhancing the immersion and making each encounter feel impactful. Doomguy’s grunts and the screeches of enemies provide instant feedback, reinforcing the fast-paced, brutal nature of the gameplay.", "conclusion": "Doom is a timeless classic that changed gaming forever. Its blend of fast, intense gameplay, atmospheric graphics, and unforgettable soundtrack make it as thrilling today as it was in 1993. While the graphics and mechanics may feel dated to modern players, the game’s core experience remains incredibly engaging and fun. Doom’s legacy lives on not only through its sequels but also through the FPS genre it helped define. For anyone interested in the roots of first-person shooters or looking for a challenging, action-packed experience, Doom is an essential play that stands the test of time.", "rating": "9.8", "ano": 1993, "desenvolvedor": "id software", "distribuidor": "id Software", "imagem": "16c37f0a-79e5-4a12-b20d-fa9967ed40d0.jpg", "capa": "13ce3479-6318-4cd2-b7e4-9144e88c18dd.jpg", "video": "https://www.youtube.com/watch?v=8mEP4cflrd4", "generos": [1, 6]}}, {"model": "core.games", "pk": 2, "fields": {"criado": "2024-10-06", "modificado": "2024-11-30", "ativo": true, "game": "Hexen: Beyond Heretic", "descricao": "Hexen: Beyond Heretic, developed by Raven Software and published by id Software in 1995, is a dark fantasy first-person shooter and the spiritual successor to Heretic. Set in the world of Cronos, Hexen thrusts players into a cursed, decaying realm overrun by monsters and ruled by the dark Serpent Riders. Players choose one of three unique character classes—Fighter, Cleric, or Mage—each with their own abilities and weapons. This blend of RPG elements, puzzle-solving, and FPS action made Hexen a distinctive title that stood out among 90s shooters for its atmosphere, complexity, and ambitious design.", "gameplay": "Hexen’s gameplay is a departure from the straightforward run-and-gun style of traditional shooters, emphasizing exploration, puzzle-solving, and strategic combat. The game’s three classes each offer a unique playstyle: the Fighter relies on melee weapons and resilience, the Cleric balances physical and magical attacks, and the Mage specializes in powerful ranged spells. This class system encourages replayability, as each class provides a different approach to combat and exploration.\r\n\r\nLevels in Hexen are sprawling and interconnected, often requiring players to revisit areas after solving complex puzzles or unlocking doors, making it feel more like a dungeon crawler than a typical FPS. The game is challenging, with traps, hidden switches, and enemies lurking at every turn. Additionally, Hexen introduced a hub system, allowing players to travel between levels to progress the story and complete objectives. This non-linear design adds depth and complexity to gameplay, but also demands patience and critical thinking.", "graphics": "For 1995, Hexen featured detailed, atmospheric graphics that captured its dark fantasy setting. Built on a modified version of the Doom engine, the game introduced features like weather effects, colored lighting, and the ability to look up and down, enhancing the sense of immersion and realism. The environments are richly designed, with eerie castles, haunted forests, and desolate temples that exude a sense of decay and danger. The character and enemy sprites are well-crafted, fitting the game’s grim, foreboding aesthetic. While the visuals are dated by modern standards, Hexen retains a unique charm that evokes the ominous, Gothic feel of classic dark fantasy.", "sound_and_music": "The sound and music in Hexen contribute heavily to its immersive atmosphere. The soundtrack, composed by Kevin Schilder, is haunting and subtle, featuring ambient, orchestral music that complements the game’s dark tone without overpowering the action. Each level’s music varies, with eerie, echoing tunes that amplify the tension and dread of exploring Cronos’s cursed lands. The sound effects are equally effective, from the guttural roars of monsters to the satisfying clang of swords and spells. The ambient sounds of wind, thunder, and dripping water further enhance the game’s dark fantasy atmosphere, making each encounter feel intense and unsettling.", "conclusion": "Hexen: Beyond Heretic is a unique blend of FPS action, dark fantasy, and RPG elements, offering a challenging, atmospheric experience unlike most shooters of its era. Its class-based combat, intricate puzzles, and hub-based level design encourage exploration and strategy, providing a depth that stands out among 90s FPS games. While the game’s graphics and controls may feel dated today, its dark aesthetic, immersive sound design, and complex gameplay make Hexen a memorable and rewarding experience for fans of retro shooters and fantasy games alike. For those looking to explore a darker side of the FPS genre, Hexen remains a captivating journey into a cursed world.", "rating": "8.3", "ano": 1995, "desenvolvedor": "Raven Software", "distribuidor": "id Software", "imagem": "c5cd842d-754d-4cbc-97c9-cf6972786771.jpg", "capa": "cfa3a085-74c9-4120-be9e-b79a74c8ebfe.jpg", "video": "https://www.youtube.com/watch?v=rvpdrvLA0s8", "generos": [1, 6]}}, {"model": "core.games", "pk": 3, "fields": {"criado": "2024-10-06", "modificado": "2024-11-30", "ativo": true, "game": "I Have No Mouth, and I Must Scream", "descricao": "I Have No Mouth, and I Must Scream, developed by Cyberdreams and released in 1995, is a point-and-click adventure game based on the 1967 short story by Harlan Ellison. Co-written by Ellison himself, the game brings players into a dark, dystopian world controlled by AM, a malevolent AI who has tormented five human captives for over a century. Known for its mature themes, psychological depth, and philosophical undertones, I Have No Mouth, and I Must Scream is a haunting exploration of human suffering and redemption, pushing players to confront difficult moral decisions in a game that feels more like an interactive experience than a traditional adventure.", "gameplay": "The gameplay in I Have No Mouth, and I Must Scream follows a point-and-click structure, where players explore environments, interact with objects, and converse with other characters to progress. Each of the five protagonists has a unique story and a set of personal challenges crafted by AM to exploit their deepest fears and regrets. These scenarios force players to make morally ambiguous choices that impact the storyline, leading to different endings. The game emphasizes psychological exploration and ethical dilemmas over puzzle complexity, offering an experience that focuses more on introspection and narrative impact than traditional adventure mechanics.\r\n\r\nEach character’s journey delves into themes such as guilt, abuse, and self-acceptance, encouraging players to examine their choices carefully. The game’s lack of clear “right” answers creates a tense, thought-provoking experience where actions can have significant consequences. While the mechanics may feel simplistic to fans of traditional point-and-click puzzles, the depth of each character’s story and the weight of each decision make the gameplay impactful and memorable.", "graphics": "For its time, I Have No Mouth, and I Must Scream features detailed pixel art and a distinct visual style that captures the eerie, oppressive atmosphere of AM’s world. The environments are dark and unsettling, with each character’s scenario set in a unique, symbolic location designed to reflect their trauma. The art style successfully conveys a sense of despair and entrapment, creating a haunting atmosphere that underscores the themes of the story. Character animations are minimal but expressive, emphasizing the emotional weight of the dialogue and interactions. Though the graphics may seem dated today, the game’s visuals remain effective in delivering a disturbing, immersive experience.", "sound_and_music": "The sound design is crucial to the game’s psychological impact, with an ambient, unsettling score that complements the dystopian atmosphere. The music shifts between eerie silence and tension-building melodies, intensifying the emotional impact of key scenes. The voice acting is also noteworthy, particularly with Harlan Ellison himself voicing AM, bringing the character’s sadistic personality to life with chilling effectiveness. The voice acting for the human characters is expressive, capturing the fear, regret, and suffering each one feels. Sound effects are minimal but add to the sense of desolation, allowing players to focus on the harrowing themes and heavy dialogue.", "conclusion": "I Have No Mouth, and I Must Scream is a dark, challenging exploration of human nature, morality, and psychological torment. Its mature themes and ethical dilemmas push players to confront difficult issues, making it more of an interactive narrative than a traditional adventure game. Although the graphics and mechanics may feel dated, the game’s storytelling, atmosphere, and emotional depth make it a haunting experience that lingers long after the credits roll. For players seeking a thought-provoking, unsettling experience, I Have No Mouth, and I Must Scream is a unique and unforgettable journey into the darker sides of humanity.", "rating": "8.9", "ano": 1995, "desenvolvedor": "The Dreamers Guild, Cyberdreams", "distribuidor": "Nightdive Studios", "imagem": "7b2253d9-63d3-4bab-8adf-409ebbf97608.jpg", "capa": "a146d4b4-5880-4312-9eda-372a33d2c284.jpg", "video": "https://www.youtube.com/watch?v=URFYCU5qhLE", "generos": [2, 3]}}, {"model": "core.games", "pk": 4, "fields": {"criado": "2024-10-07", "modificado": "2024-11-28", "ativo": true, "game": "Planescape: Torment", "descricao": "Planescape: Torment, developed by Black Isle Studios and released in 1999, is an RPG that stands out for its deep storytelling, unique setting, and philosophical themes. Set in the Planescape universe from Dungeons & Dragons, the game follows the journey of The Nameless One, an immortal amnesiac searching for answers about his past and the nature of his existence. Known for its rich dialogue, complex characters, and thought-provoking narrative, Planescape: Torment became an iconic title that challenged the conventions of the RPG genre, offering a story-driven experience unlike any other.", "gameplay": "Planescape: Torment emphasizes narrative and character development over traditional combat, making it a unique RPG experience. The game uses an isometric perspective, similar to other titles of its time, but the core gameplay focuses on exploration, dialogue, and choices rather than dungeon-crawling and combat. Players control The Nameless One and a group of companions, each with their own unique stories and abilities. Dialogue choices are extensive and impactful, often leading to different story paths and outcomes that shape the characters and the world around them.\r\n\r\nCombat follows a real-time-with-pause system, giving players time to strategize, but it is not the main focus. Instead, players are encouraged to use dialogue and problem-solving to navigate the world. Planescape: Torment also offers an unusual character progression system, where players can change classes, gain new abilities, and even unlock memories and abilities tied to The Nameless One’s past. The game’s non-linear structure and emphasis on storytelling make it an experience that rewards careful exploration and decision-making.", "graphics": "The graphics in Planescape: Torment are distinctive and atmospheric, capturing the strange, surreal beauty of the Planescape setting. The hand-painted backgrounds are richly detailed, showcasing otherworldly environments that range from dark cityscapes to bizarre, ethereal landscapes. Sigil, the City of Doors, feels alive and immersive, filled with strange architecture, bustling markets, and eerie shadowed alleys. Character sprites and animations are expressive for the time, adding to the game’s distinct visual style. While the graphics may appear dated to modern players, they retain a unique charm that fits the dark, philosophical tone of the game and reinforces its immersive storytelling.", "sound_and_music": "The sound design in Planescape: Torment is subtle but effective, with a haunting soundtrack composed by Mark Morgan that adds depth to the game’s atmosphere. The music features ambient, melancholic themes that enhance the feeling of mystery and introspection throughout The Nameless One’s journey. Each area has its own distinct soundtrack, from the dark, gritty tones of Sigil to the more ethereal melodies of other planes, creating a rich auditory backdrop for the game’s world.\r\n\r\nVoice acting is limited but impactful, with key characters receiving memorable performances that bring depth and personality to the dialogue. Sound effects are appropriately minimal, allowing the ambient sounds and music to carry the emotional weight of each scene. The game’s audio design complements the visuals and storytelling, helping to immerse players in its unique and otherworldly setting.", "conclusion": "Planescape: Torment is a landmark in RPG storytelling, offering a complex, introspective journey that explores themes of identity, mortality, and redemption. Its focus on dialogue, character development, and moral ambiguity makes it an RPG that challenges players to think deeply and make difficult choices. Although the combat and graphics may feel dated by today’s standards, the game’s story, atmosphere, and philosophical depth continue to resonate with players. For fans of narrative-driven games and those seeking a thought-provoking experience, Planescape: Torment is an unforgettable classic that exemplifies the potential of video games as a medium for storytelling. It remains a must-play for anyone interested in RPGs or games that prioritize story and character above all else.", "rating": "9.2", "ano": 1999, "desenvolvedor": "Black Isle Studios", "distribuidor": "Interplay Entertainment", "imagem": "eeb576f2-8f35-4415-af8f-e3354eb27618.jpg", "capa": "af5d2e6a-5297-44f4-9e73-177944203198.jpg", "video": "https://www.youtube.com/watch?v=9XFaT3WM1gM", "generos": [9, 3, 5]}}, {"model": "core.games", "pk": 5, "fields": {"criado": "2024-10-08", "modificado": "2024-11-26", "ativo": true, "game": "Quake", "descricao": "Quake by id Software is a groundbreaking 1996 first-person shooter that took the gaming world by storm. As the successor to DOOM, Quake pushed the genre forward, introducing real-time 3D graphics and online multiplayer features. Set in a dark, medieval, and Lovecraftian world, Quake places players in the role of a lone marine fighting through grotesque dimensions filled with deadly monsters. This sinister atmosphere, combined with fluid gameplay and advanced technical elements, made Quake a defining title in FPS history.", "gameplay": "Quake offers fast-paced, intense gameplay that challenges reflexes and tactics. The game’s mechanics are straightforward yet polished, focusing on smooth movement, precise shooting, and advanced enemy AI. Players navigate through maze-like levels, finding keys, solving puzzles, and fighting relentless waves of enemies. Quake introduced true 3D movement, which allowed for more dynamic level designs and vertical combat, setting a new standard for the FPS genre. The arsenal includes an array of weapons—from shotguns to the iconic rocket launcher—that feel powerful and rewarding, essential in dealing with Quake’s challenging enemies.\r\n\r\nOne of Quake's major innovations was its online multiplayer. By connecting through the early Internet, players could experience deathmatches against others in real time, creating an entirely new way to enjoy FPS games. The game’s multiplayer was so influential that it became the foundation of competitive online gaming.", "graphics": "For its time, Quake was a technical marvel. It introduced real-time 3D polygonal graphics, allowing for smoother and more immersive visuals than the sprite-based models seen in previous games. The textures are gritty, dark, and atmospheric, perfectly complementing the game’s horror-inspired setting. The lighting effects—another innovation—add depth and suspense, casting shadows that create a haunting experience. Although the graphics are now dated, Quake's visuals retain a unique charm that is instantly recognizable and still respected in the retro gaming community.", "sound_and_music": "The audio design of Quake is outstanding, featuring ambient sounds and eerie soundscapes that heighten the horror atmosphere. The soundtrack, composed by Nine Inch Nails’ frontman Trent Reznor, adds a layer of intensity and unease to each level. Reznor’s music blends industrial and atmospheric sounds, enhancing the game’s feeling of isolation and dread. Sound effects are crisp, with weapons and enemy noises giving a satisfying impact that draws players deeper into the action. This combination of sound and music creates an immersive audio experience that perfectly matches Quake’s dark, foreboding tone.", "conclusion": "Quake is a monumental achievement that left a lasting legacy in the world of first-person shooters. Its innovations in gameplay, graphics, and sound design set new standards that still influence FPS games today. Although some aspects may feel outdated by modern standards, Quake remains a thrilling, challenging, and atmospheric experience that fans of retro games and FPS history will appreciate. Whether for its revolutionary multiplayer or its unforgettable aesthetic, Quake is a must-play classic that stands the test of time.", "rating": "9.7", "ano": 1996, "desenvolvedor": "id software", "distribuidor": "id Software", "imagem": "550486b2-7363-42d6-abba-24ab141140ea.jpg", "capa": "dccc9547-a30f-4fe3-9980-9e075f5c180d.jpg", "video": "https://www.youtube.com/watch?v=VwXDS3UAVcA", "generos": [6]}}, {"model": "core.games", "pk": 7, "fields": {"criado": "2024-10-09", "modificado": "2024-11-30", "ativo": true, "game": "Duke Nukem 3D", "descricao": "Duke Nukem 3D (1996), developed by 3D Realms, is a groundbreaking first-person shooter that defined much of what makes FPS games exciting and memorable. The game centers on Duke Nukem, an action hero with an exaggerated, macho personality who’s determined to rid the world of an alien invasion. Duke’s character is a satirical mix of 80s and 90s action movie tropes, giving him a unique, humorous edge that permeates every level. Set in a chaotic, fictional version of Los Angeles, the game blends intense action, intricate level design, and interactive environments with a heavy dose of adult humor and cultural references, making it one of the most iconic and memorable FPS games of its era.", "gameplay": "Duke Nukem 3D sets itself apart with its engaging, non-linear level design and interactive environments. Players are free to explore levels that are filled with hidden areas, alternate routes, and countless secrets, adding an element of discovery rare for games of the time. Duke can interact with objects like mirrors, light switches, arcade machines, and even toilets, creating a surprising level of immersion. The game’s arsenal is also noteworthy, including standard firearms like pistols and shotguns, as well as more unique weapons such as the Shrink Ray, which shrinks enemies so Duke can crush them underfoot, and the Freezethrower, which lets players freeze enemies in their tracks.\r\n\r\nThe fast-paced action and creative weapon choices make the gameplay highly engaging, requiring quick reflexes and offering various strategies for approaching enemies. Duke’s personality shines through in his one-liners, which punctuate the action with humor and attitude. Each level is designed to encourage players to think creatively and take advantage of the environment, rewarding those who experiment with different tactics.", "graphics": "For its time, Duke Nukem 3D’s graphics were impressive, powered by the Build engine, which allowed for detailed, semi-3D environments that stood out in the 90s FPS scene. Today, the visuals are undeniably dated, with pixelated textures and low-resolution sprites, but they carry a nostalgic charm that fans of retro games can appreciate. The gritty, urban environments and diverse level settings—from dark city streets to adult clubs and eerie space stations—create a unique atmosphere that feels both immersive and tongue-in-cheek. The visual style may not hold up against modern standards, but for fans of the genre, it’s part of the game’s unique appeal.", "sound_and_music": "The sound design in Duke Nukem 3D is an integral part of its charm. Duke’s deadpan voice lines are memorable and iconic, contributing to the character’s larger-than-life persona. Quotes like “It’s time to kick ass and chew bubblegum... and I’m all out of gum” have become legendary in gaming culture. The rock-inspired soundtrack, composed by Lee Jackson, perfectly complements the game’s high-octane action with intense, rhythmic music that adds to the adrenaline. Sound effects—from the satisfying gunfire and explosions to the growls and cries of aliens—are distinct and immersive, enhancing the chaotic atmosphere and making each encounter feel impactful.", "conclusion": "Duke Nukem 3D is a timeless classic that still holds a special place in the hearts of FPS fans. Its humor, creative level design, and fast-paced gameplay make it a standout experience, even decades after its release. While the graphics and humor might feel a bit dated today, the game’s impact on the FPS genre is undeniable. For fans of retro shooters who enjoy action mixed with satire, Duke Nukem 3D offers a unique, unforgettable adventure filled with explosive action, memorable lines, and a protagonist who’s as outrageous as he is entertaining.", "rating": "9.3", "ano": 1996, "desenvolvedor": "3D Realms", "distribuidor": "3D Realms", "imagem": "f1a9e50c-75e5-4535-beaa-4b6128df055a.jpg", "capa": "4a7ed191-5e82-4d9c-ba6f-18308af7ec8c.jpg", "video": "https://www.youtube.com/watch?v=cRF-B_f-VZc", "generos": [3, 6]}}, {"model": "core.games", "pk": 8, "fields": {"criado": "2024-10-11", "modificado": "2024-11-30", "ativo": true, "game": "Blood", "descricao": "Blood, developed by Monolith Productions and released in 1997, is a first-person shooter that stands out for its dark humor, horror-themed setting, and brutal gameplay. Players assume the role of Caleb, a gunslinger risen from the grave to exact revenge on the dark cult that betrayed him. Set in a nightmarish world filled with occult symbolism, gothic architecture, and an endless horde of grotesque enemies, Blood offers a horror experience unique among shooters of its time. The game’s blend of relentless action, creepy atmosphere, and iconic weaponry makes it a memorable entry in the FPS genre.", "gameplay": "The gameplay in Blood is fast-paced and punishing, demanding precision, quick reflexes, and a tactical approach to survive the relentless waves of enemies. Caleb’s arsenal is extensive, featuring classic weapons like shotguns and Tommy guns, alongside more unique and twisted tools like the flare gun, voodoo doll, and aerosol can used as a makeshift flamethrower. Each weapon has a satisfying, deadly impact that makes combat both thrilling and challenging, especially when facing large enemy groups.\r\n\r\nLevels are intricately designed with plenty of secrets, hidden rooms, and branching paths, encouraging exploration. Blood introduces a range of enemy types, from standard cultists and zombies to more nightmarish creatures like gargoyles and hellhounds. The AI is aggressive and challenging, making each encounter tense and forcing players to strategize. Blood also introduced various multiplayer modes, including cooperative and deathmatch, which allowed players to share in the chaotic fun with friends.", "graphics": "Blood uses the Build engine, the same engine behind Duke Nukem 3D, and its visuals, while pixelated by modern standards, create an unmistakable horror aesthetic. The environments are dark, atmospheric, and filled with grim details, from eerie crypts to haunted mansions, each level dripping with gothic horror vibes. Despite its age, the art style is memorable, with creative use of textures and lighting that enhances the game’s dark, eerie atmosphere. The pixel art for enemies and weapons is detailed, adding to the game’s gritty and immersive feel.", "sound_and_music": "The sound design in Blood is a standout feature, adding a layer of tension and atmosphere to each level. Caleb’s taunts and one-liners are darkly humorous, giving the character personality and levity amid the horror. The game’s sound effects are visceral, with satisfying explosions, the haunting groans of zombies, and the unnerving chants of cultists that enhance the creepy atmosphere. The soundtrack is minimalistic, with ambient and unsettling tunes that keep players on edge, making the game feel like a horror movie in which you’re the star.", "conclusion": "Blood is a cult classic that blends horror, action, and dark humor to create a unique FPS experience. Its challenging gameplay, creepy atmosphere, and distinctive aesthetic set it apart from other shooters of the era. While it may not be for everyone due to its high difficulty and dark themes, Blood is a must-play for fans of horror-themed shooters and retro FPS games. It’s a brutal, unforgettable journey that has earned its place as one of the most beloved and distinctive shooters from the ‘90s.", "rating": "8.7", "ano": 1997, "desenvolvedor": "Monolith Productions", "distribuidor": "GT Interactive", "imagem": "c1b50bbb-a5b2-48ec-bc84-f4edb8b4cfaa.jpg", "capa": "2405f3f6-c992-4153-ac20-4fa77381580a.jpg", "video": "https://www.youtube.com/watch?v=5m8_W9V77cM", "generos": [6]}}, {"model": "core.games", "pk": 9, "fields": {"criado": "2024-10-11", "modificado": "2024-12-04", "ativo": true, "game": "Myst", "descricao": "Myst, developed by Cyan Worlds and released in 1993, is an adventure game that redefined the genre with its stunning visuals, atmospheric storytelling, and unconventional gameplay. The player is transported to the mysterious island of Myst, where they must explore its strange landscapes, solve intricate puzzles, and uncover a story woven through various \"Ages.\" With a focus on exploration and discovery, Myst became a groundbreaking title that captivated players with its immersive world and minimalist approach to storytelling, cementing its legacy as one of the most iconic and influential games of the 1990s.", "gameplay": "Myst’s gameplay is centered on exploration, observation, and puzzle-solving rather than traditional action or combat. Players move through the game by clicking on different areas of the island, slowly revealing Myst’s secrets and interconnected landscapes. The puzzles are challenging and intricately designed, often requiring players to pay close attention to the environment, gather clues, and think creatively to progress. There are no hints or guidance systems, which enhances the game’s sense of mystery and pushes players to experiment and persevere.\r\n\r\nEach puzzle is integrated into the story, tied to the unique histories and mechanics of Myst’s various Ages. The gameplay encourages patience and logical thinking, making each solved puzzle feel like a rewarding breakthrough. While some puzzles may feel daunting or obscure, they add to the overall feeling of discovery that defines Myst. Its non-linear structure allows players to explore at their own pace, making the journey as important as the destination.", "graphics": "For its time, Myst boasted groundbreaking graphics, featuring pre-rendered 3D environments that were detailed, atmospheric, and visually stunning. The world of Myst is richly designed, with each Age featuring unique visual styles and settings that draw players deeper into the game’s lore. From misty forests to mechanical worlds, every location has a sense of wonder and artistry that captures the imagination.\r\n\r\nAlthough Myst’s static images and point-and-click movement may feel outdated by modern standards, the visuals remain impressive for their aesthetic quality and attention to detail. The graphics helped create a deeply immersive experience, and for many players in the 90s, Myst offered a visual fidelity and sense of realism that was unmatched.", "sound_and_music": "he sound design and music in Myst contribute significantly to its atmosphere and sense of mystery. The game’s soundtrack, composed by Robyn Miller, is minimal and haunting, blending ambient tones with gentle melodies that enhance the eerie beauty of each Age. The music serves to create an emotional backdrop, pulling players deeper into the game’s world without overshadowing the puzzles or exploration.\r\n\r\nSound effects, from the rustle of leaves to the hum of machinery, are subtly integrated into the environment, adding to the sense of realism and immersion. These ambient sounds enhance the feeling of being alone on a mysterious, deserted island, emphasizing the game’s quiet, introspective nature. Myst’s audio design is understated yet effective, complementing the visuals and gameplay to create a unique and atmospheric experience.", "conclusion": "Myst is a masterpiece of game design, blending atmospheric storytelling, challenging puzzles, and stunning visuals to create an unforgettable journey. Its focus on exploration and discovery, coupled with a deep sense of mystery, makes it a timeless experience that continues to captivate players. Though the graphics and gameplay style may feel dated to modern audiences, the core experience of Myst—its beauty, atmosphere, and sense of wonder—still holds up. For fans of adventure and puzzle games, Myst is a must-play classic that offers a journey of curiosity, patience, and reward, and it remains a landmark title in the history of gaming.", "rating": "9.9", "ano": 1993, "desenvolvedor": "Cyan Worlds", "distribuidor": "Brøderbund Software", "imagem": "64c0523d-16f7-4219-9e15-aae5effdc284.jpg", "capa": "8f84af9a-fc51-4500-b681-b72c86324eb6.jpg", "video": "https://www.youtube.com/watch?v=2b384kZKAJQ", "generos": [9, 2, 3]}}, {"model": "core.games", "pk": 10, "fields": {"criado": "2024-10-11", "modificado": "2024-12-04", "ativo": true, "game": "Bad Mojo", "descricao": "Bad Mojo, developed by Pulse Entertainment and released in 1996, is a dark and unique adventure game often described as “The Cockroach Game.” Inspired by Kafka’s The Metamorphosis, it follows the story of Roger Samms, a scientist who, after an experiment gone wrong, is transformed into a cockroach. Set in a gritty, dirty, and grimy apartment, Bad Mojo offers a surreal, unsettling experience as players navigate the world from a cockroach’s perspective. Its eerie atmosphere, unconventional premise, and disturbing imagery set it apart from typical adventure games, making it one of the most memorable cult classics of the 90s.", "gameplay": "The gameplay in Bad Mojo is centered on exploration and puzzle-solving from a cockroach’s point of view. Players control Roger as he crawls through various environments, including floors covered in filth, cabinets filled with food scraps, and vents crawling with other insects. The controls are simple but challenging, as moving through the world as a cockroach feels clumsy and dangerous. Obstacles include puddles, rats, and even human encounters, which create life-or-death situations that force players to navigate carefully and think strategically.\r\n\r\nPuzzles are environmentally based, requiring players to understand and interact with objects in ways only a cockroach could—crawling through cracks, avoiding human hazards, and manipulating the environment to progress. The perspective shift adds depth to the puzzles, making everyday objects seem massive and daunting. Though some puzzles can be difficult due to the fixed camera angles and sometimes finicky controls, the gameplay is immersive and genuinely unique, capturing the challenges of surviving as an insect in a human world.", "graphics": "For its time, Bad Mojo offered striking visuals, using pre-rendered backgrounds and full-motion video to create a realistic and gritty setting. The game’s environments are detailed, capturing the textures of grime, filth, and decay with an uncomfortable level of realism. The imagery of floors coated with hair, spilled liquids, and food scraps adds to the disturbing, grimy aesthetic that defines the game. The perspective also makes everything look enormous and ominous, enhancing the sense of isolation and vulnerability as players crawl through these spaces.\r\n\r\nThe full-motion video segments and cutscenes further the story and add a surreal, cinematic feel to the experience. Although the graphics are dated by modern standards, the game’s visual style remains unsettling and atmospheric, making Bad Mojo a standout example of 90s FMV adventure games.", "sound_and_music": "The sound design in Bad Mojo plays a crucial role in establishing its eerie atmosphere. The soundtrack, composed by Xorcist, features industrial and ambient sounds that create a tense and unsettling mood, perfectly matching the game's dark tone. The music is subtle, allowing the environmental sounds to take precedence. Players hear the scrapes of cockroach legs, dripping water, and distant hums, all of which add immersion and reinforce the world from a cockroach’s perspective.\r\n\r\nThe game also includes occasional voiceovers and sound effects during pivotal story moments, adding emotional weight to Roger’s predicament. While not overly complex, the sound design is fitting and enhances the game's grim atmosphere, making players feel genuinely immersed in this bizarre world.", "conclusion": "Bad Mojo is a unique, atmospheric, and hauntingly original game that stands out for its unconventional premise and disturbing setting. By turning players into a cockroach, the game offers an experience that is both fascinating and unsettling, challenging players with puzzles and obstacles from an insect’s perspective. While the controls and fixed camera angles may feel awkward at times, the game’s immersive visuals, eerie sound design, and surreal story make it a memorable journey into the bizarre. Bad Mojo is a true cult classic, perfect for players seeking an adventure game that strays from the beaten path. It’s a dark, unforgettable experience that captures the essence of horror and survival in the most unusual way.", "rating": "8.2", "ano": 1996, "desenvolvedor": "Pulse Entertainment", "distribuidor": "Pulse Entertainment", "imagem": "426b2c16-47e6-4758-8550-a71852d3c4f2.jpg", "capa": "788a7df6-74bd-43c4-a052-f1234c06d834.jpg", "video": "https://www.youtube.com/watch?v=qOk7l86mbvM", "generos": [2, 3]}}, {"model": "core.games", "pk": 11, "fields": {"criado": "2024-10-11", "modificado": "2024-12-02", "ativo": true, "game": "Cyberia", "descricao": "Cyberia, developed by Xatrix Entertainment and released in 1994, is an action-adventure game that combines puzzle-solving, on-rails shooting, and cinematic storytelling set in a dystopian cyberpunk world. The game follows the story of Zak Kingston, a hacker recruited to infiltrate a mysterious research facility known as Cyberia Complex, which houses a powerful and potentially world-ending weapon. With a mix of pre-rendered cinematic sequences and 3D graphics, Cyberia aimed to immerse players in a futuristic world filled with espionage, danger, and mystery.", "gameplay": "Cyberia blends multiple gameplay styles, including puzzles, on-rails shooting segments, and exploration. Each section of the game presents unique challenges, from solving environmental puzzles to surviving intense action sequences. The puzzles are varied and require logical thinking, often serving as a break from the more intense combat scenes. The shooting sequences place players in various vehicle-mounted turrets or in high-stakes shootouts, challenging reflexes and accuracy. While these segments are exciting, they are often unforgiving, requiring players to learn through trial and error, which can be frustrating at times.\r\n\r\nThe game’s story unfolds through interactive cutscenes and dialog choices, adding a level of depth and narrative engagement that was rare for its time. Though the gameplay can feel linear, Cyberia’s mix of puzzle-solving and action keeps players engaged, offering an experience that’s both mentally stimulating and adrenaline-pumping.", "graphics": "For 1994, Cyberia’s graphics were impressive, featuring pre-rendered backgrounds and 3D character models that added a cinematic quality to the game. The futuristic environments, dark corridors, and high-tech labs are well-designed, capturing the bleak, cyberpunk aesthetic that defines the game. The use of pre-rendered cinematics to drive the story forward adds a layer of immersion and sophistication, creating a sense of high-stakes drama and visual storytelling. However, while the visuals were groundbreaking at the time, they may seem outdated by today’s standards. The blocky 3D models and low-resolution textures reflect the early era of 3D gaming, but they also add to the game’s retro appeal for fans of 90s cyberpunk.", "sound_and_music": "The sound and music in Cyberia play a crucial role in building its atmosphere. The soundtrack, composed by Thomas Dolby, is dark and moody, with industrial and ambient influences that fit the game’s cyberpunk theme perfectly. The music adds tension to puzzle-solving moments and ramps up during action sequences, making the stakes feel higher and more intense. Sound effects, from the hum of machinery to the blasts of gunfire, enhance the sense of immersion, while voice acting helps to convey the narrative, even if it occasionally feels dated. Overall, the audio design complements the game’s aesthetic and keeps players invested in the story and action.", "conclusion": "Cyberia is an ambitious and immersive game that blends action, puzzles, and storytelling in a way that was innovative for its time. Its mix of gameplay styles, cinematic presentation, and cyberpunk atmosphere make it a memorable experience that captures the essence of mid-90s interactive storytelling. While the graphics and controls may feel dated by modern standards, the game’s unique style and immersive narrative still hold up for those who appreciate retro games and cyberpunk settings. Cyberia is a classic for fans of adventure games and sci-fi storytelling, offering a thrilling journey into a dark and dystopian future.", "rating": "7.4", "ano": 1994, "desenvolvedor": "Xatrix Entertainment", "distribuidor": "Interplay Entertainment", "imagem": "d284be79-f777-4474-b62b-3996039db65c.jpg", "capa": "750eb650-35e6-4269-9ded-8ba634307d85.jpg", "video": "https://www.youtube.com/watch?v=RVar9s-JcZo", "generos": [2, 3, 6, 7]}}, {"model": "core.games", "pk": 12, "fields": {"criado": "2024-10-12", "modificado": "2024-12-03", "ativo": true, "game": "Shadow Warrior", "descricao": "Shadow Warrior, developed by 3D Realms and released in 1997, is a first-person shooter that combines intense action, dark humor, and a dose of martial arts to create a memorable experience. Built on the same Build engine as Duke Nukem 3D, Shadow Warrior follows Lo Wang, a wise-cracking, katana-wielding assassin who fights against the forces of his former employer, Zilla Enterprises, which is attempting to take over Japan with an army of demons and henchmen. Shadow Warrior offers a mix of explosive action and irreverent humor, delivering a unique, tongue-in-cheek take on classic FPS gameplay.", "gameplay": "Shadow Warrior excels in its variety and complexity of gameplay. Like its Build engine siblings, the game emphasizes exploration, with maze-like levels filled with secrets, hidden paths, and plenty of interactive objects. Lo Wang’s arsenal is diverse, ranging from conventional firearms like pistols and Uzis to more unique options like shurikens, the Riot Gun (a powerful shotgun), and even nuclear warheads. One of the game’s signature features is Lo Wang’s katana, allowing players to switch to melee combat, which feels satisfying and effective in close quarters.\r\n\r\nThe game’s levels are filled with both human and supernatural enemies, each with different abilities and attack patterns. Shadow Warrior encourages players to experiment with different weapons and tactics, as some enemies are more vulnerable to specific weapons. The game also features drivable vehicles, including tanks and boats, adding an extra layer of variety to the gameplay. The difficulty is challenging, but it strikes a balance that rewards strategy and quick thinking, making each level engaging and dynamic.", "graphics": "For 1997, Shadow Warrior’s graphics were impressive, leveraging the Build engine to create detailed environments inspired by Japanese architecture and mythology. The levels are richly decorated, ranging from urban cityscapes to ancient temples and mountain fortresses. The game uses the Build engine’s capabilities to create intricate textures, lighting, and destructible objects, adding depth to the game world. Although the graphics may look dated by today’s standards, Shadow Warrior’s unique aesthetic and detailed environments still hold up for retro enthusiasts, providing a colorful and immersive backdrop to the intense action.", "sound_and_music": "The sound design in Shadow Warrior adds to its unique atmosphere. Lo Wang’s humorous one-liners and taunts give the character personality and inject humor into tense situations, similar to Duke Nukem’s style. The game’s soundtrack, while not as pronounced as the music in Doom or Quake, features a mix of traditional Japanese instruments and rock-inspired tracks that complement the setting and pace of the gameplay. Sound effects are punchy and satisfying, with each weapon having a distinct sound that enhances the feel of combat. Enemies have memorable sound cues, adding to the overall immersion and giving players audio hints of nearby threats.", "conclusion": "Shadow Warrior is a standout entry in the 90s FPS genre, blending fast-paced action with humor and a unique setting. Its mix of diverse weaponry, interactive environments, and tongue-in-cheek style set it apart from other shooters of the era. While certain aspects, like the graphics, may feel dated, Shadow Warrior remains a fun and challenging experience for fans of retro FPS games. With its irreverent humor and intense gameplay, Shadow Warrior holds a special place in the history of first-person shooters and is still worth exploring for anyone interested in the roots of the genre.", "rating": "7.9", "ano": 1997, "desenvolvedor": "3D Realms", "distribuidor": "3D Realms", "imagem": "9fc43255-7a29-4a02-a562-d4501e6bafb4.jpg", "capa": "07d17b14-b3b4-49c6-9bbd-406a74f74356.jpg", "video": "https://www.youtube.com/watch?v=bQE1ybaGYcE", "generos": [1, 6]}}, {"model": "core.games", "pk": 13, "fields": {"criado": "2024-10-16", "modificado": "2024-11-27", "ativo": true, "game": "Star Wars: Dark Forces", "descricao": "Star Wars: Dark Forces, developed by LucasArts and released in 1995, is a first-person shooter that brought the Star Wars universe to the FPS genre for the first time. Set before the events of A New Hope, the game follows Kyle Katarn, a mercenary hired by the Rebel Alliance to uncover the Empire’s sinister plans and thwart their dark projects, such as the Dark Trooper program. Dark Forces introduces players to a mix of classic Star Wars storytelling and action-packed gameplay, immersing them in battles across iconic and new locations within the Star Wars universe.", "gameplay": "Dark Forces was revolutionary for its time, combining elements of traditional FPS games with a touch of Star Wars lore and storytelling. The game introduces a variety of mission-based objectives, requiring players to not only survive but also solve puzzles, find key items, and unlock doors to progress. This approach adds depth to the gameplay, setting it apart from more straightforward shooters of the era. Players control Kyle Katarn as he battles stormtroopers, Imperial officers, and bounty hunters with a range of weapons—from blasters and thermal detonators to the classic Stormtrooper rifle. The game also includes elements like crouching, jumping, and multi-level areas, which were innovative mechanics for a mid-90s FPS.\r\n\r\nEach level is richly designed, capturing the feel of the Star Wars universe. The AI is challenging, and the variety of enemies makes for exciting and unpredictable encounters. Dark Forces doesn’t have multiplayer, but the single-player campaign is lengthy and well-paced, offering a series of missions that build in complexity and tension.", "graphics": "For 1995, Dark Forces pushed the boundaries of FPS graphics. While built on a modified version of the Jedi Engine (LucasArts’ proprietary tech), the game introduced real 3D environments with stairs, catwalks, and multiple floors—features that were rare for the time. The textures and level designs are iconic and faithfully recreate Star Wars aesthetics, with environments like Imperial bases, starships, and urban landscapes. The color palette and lighting create a moody, dark atmosphere that complements the tone of the game and Star Wars universe. While Dark Forces’ graphics are dated by today’s standards, they still capture a certain retro appeal and the classic Star Wars look that fans will appreciate.", "sound_and_music": "Sound and music are standout aspects of Dark Forces, bringing an authentic Star Wars feel to the gameplay. The soundtrack features familiar themes composed by John Williams, as well as new tracks that enhance the game’s intensity and pace. The sound effects—blaster fire, explosions, and the hum of Imperial machinery—are pulled directly from the films, making each firefight and action scene feel immersive. The voice work, though minimal, adds to the atmosphere, with characters like stormtroopers shouting warnings and alarms sounding during moments of tension. Dark Forces uses sound design not only to create an immersive environment but also to build suspense, enhancing the player’s connection to the Star Wars universe.", "conclusion": "Star Wars: Dark Forces is a memorable and significant entry in the Star Wars gaming franchise, offering an early glimpse into the rich world of Star Wars FPS games. Its engaging gameplay, innovative mechanics, and authentic sound design capture the spirit of the Star Wars universe, making it a must-play for fans of both the franchise and retro FPS games. Though the graphics may feel dated today, the game’s atmosphere, storytelling, and immersive audio still hold up, offering a nostalgic yet thrilling experience. Dark Forces set the stage for future Star Wars titles and remains a beloved classic, perfect for anyone looking to step back into a galaxy far, far away.", "rating": "8.5", "ano": 1995, "desenvolvedor": "LucasArts", "distribuidor": "LucasArts", "imagem": "a8290ada-f0c7-4354-851b-1cd74b5449cb.jpg", "capa": "bbe26d5b-bda3-4918-ab00-72e40a6268d0.jpg", "video": "https://www.youtube.com/watch?v=9YZIU9ffI3E", "generos": [3, 6]}}, {"model": "core.games", "pk": 14, "fields": {"criado": "2024-10-17", "modificado": "2024-12-05", "ativo": true, "game": "Prince of Persia", "descricao": "Prince of Persia, developed by Jordan Mechner and released in 1990, is a landmark action-platformer that redefined the genre with its fluid animation, challenging gameplay, and cinematic storytelling. Set in a Persian-inspired fantasy world, the game follows an unnamed protagonist who must escape from a dungeon and save the princess from an evil vizier named Jaffar. Prince of Persia introduced a level of realism and precision to platforming that was groundbreaking at the time, quickly establishing itself as an iconic title that influenced countless games to come.", "gameplay": "The gameplay in Prince of Persia is focused on tight platforming and precise movements. Players have only 60 minutes to escape the dungeon, adding a sense of urgency and pressure to every jump, dodge, and sword fight. The game is renowned for its realistic controls, requiring players to time their actions carefully, as even a small misstep can lead to fatal consequences. The platforming elements involve climbing, running, leaping across gaps, and avoiding deadly traps, all of which demand precision and patience.\r\n\r\nCombat is another key component, where players face off against guards in sword duels that require careful timing to block and strike. The game’s controls can feel unforgiving, especially by today’s standards, but they add to the tension and challenge, making each successful jump or fight feel like a hard-earned victory. The combination of platforming, combat, and time pressure creates a uniquely rewarding experience, though it demands patience and skill from the player.", "graphics": "For its time, Prince of Persia boasted stunning graphics and animations. Jordan Mechner used rotoscoping to create fluid, lifelike movement for the protagonist, resulting in some of the most realistic character animations ever seen in a game at the time. The backgrounds and environments are simple but evocative, capturing the atmosphere of ancient Persian architecture, with dungeons, palace halls, and shadowy corridors that feel immersive despite their simplicity.\r\n\r\nThe game’s minimalist color palette and visual style create a timeless aesthetic, and although the graphics may appear dated to modern players, they retain a certain retro charm. The fluidity of the animations, in particular, has stood the test of time, making Prince of Persia feel distinct and visually engaging even today.", "sound_and_music": "Prince of Persia keeps its audio design minimal but effective, with sparse sound effects that add to the game’s tension and focus. The clanging of swords during combat, the creak of dungeon gates, and the echo of footsteps all enhance the atmosphere without overwhelming the experience. The game does not have a continuous soundtrack, but the music cues that do appear, such as the intense theme during boss encounters, add dramatic weight to critical moments. While not as elaborate as modern soundtracks, the audio elements of Prince of Persia are fitting and enhance the game’s immersive quality.", "conclusion": "Prince of Persia is a groundbreaking title that continues to be celebrated for its innovation, challenging gameplay, and iconic animation. Its blend of precise platforming, time-based challenge, and lifelike movement set new standards for the action-platformer genre. Although the controls and graphics may feel dated to some players, the game’s core experience remains engaging and rewarding, offering a sense of accomplishment that few games achieve. Prince of Persia is a must-play classic for anyone interested in the evolution of video games, showcasing the impact of thoughtful design and the artistry of early game development. Its influence is still felt today, making it a timeless piece of gaming history.", "rating": "8.0", "ano": 1990, "desenvolvedor": "Brøderbund Software", "distribuidor": "Brøderbund Software", "imagem": "f86ed952-20cc-4161-81cd-5de57088d77c.jpg", "capa": "89396f90-44ca-4044-83b4-52c713bd049e.jpg", "video": "https://www.youtube.com/watch?v=FGQmtlxllWY", "generos": [2, 3]}}, {"model": "core.games", "pk": 15, "fields": {"criado": "2024-10-17", "modificado": "2024-12-04", "ativo": true, "game": "The Secret of Monkey Island", "descricao": "The Secret of Monkey Island, developed by Lucasfilm Games (now LucasArts) and released in 1990, is a point-and-click adventure game that revolutionized the genre with its clever humor, charming characters, and memorable story. The game follows Guybrush Threepwood, an aspiring pirate with a humorous lack of pirate skills, as he embarks on a quest to become a mighty buccaneer and win the heart of the governor, Elaine Marley. Set in the Caribbean and filled with ghost pirates, cursed treasure, and absurd puzzles, The Secret of Monkey Island is an unforgettable journey that helped establish adventure games as a genre built around wit and storytelling.", "gameplay": "The gameplay in The Secret of Monkey Island focuses on exploration, dialogue, and puzzle-solving. Players guide Guybrush through various pirate-themed locations, interacting with characters, collecting items, and using those items to solve puzzles. The puzzles are clever and often humorous, requiring players to think creatively and pay attention to the details in their surroundings. The game introduced the SCUMM interface, which makes interactions straightforward and intuitive, allowing players to select commands like “Look at,” “Pick up,” and “Talk to” by clicking on objects and characters.\r\n\r\nDialogue is a key component, as players choose responses that shape the tone of conversations and often lead to humorous outcomes. One of the game’s standout mechanics is the “insult sword fighting” sequence, where players win duels by trading witty insults rather than physical blows. This unique approach makes the game feel lively and engaging, keeping players entertained while solving puzzles and exploring the story.", "graphics": "For 1990, The Secret of Monkey Island boasted colorful, vibrant graphics that brought its Caribbean setting to life. The pixel art style captures the whimsical, lighthearted tone of the game, with detailed character sprites, exotic locations, and atmospheric environments. The art style is simple yet effective, creating a charming aesthetic that holds up well even today. Each location—from the town of Melee Island to the ghostly ship of LeChuck—is visually distinctive and brimming with personality.\r\n\r\nThe game was later remastered with updated visuals, but the original’s pixel art style remains iconic and beloved by fans, capturing a nostalgic look that defines the classic adventure game era.", "sound_and_music": "The sound and music in The Secret of Monkey Island enhance its playful, adventurous atmosphere. Composed by Michael Land, the soundtrack features catchy, Caribbean-inspired tunes that perfectly complement the game’s pirate theme. The music is memorable and upbeat, with tracks like the Melee Island theme capturing the charm and energy of Guybrush’s world.\r\n\r\nThough the original release did not include voice acting, the remastered version added voiceovers that bring additional depth to the characters without detracting from the original experience. Sound effects are sparse but fitting, with sounds like the creaking of doors, the swish of swords, and the murmurs of tavern patrons adding subtle immersion. Overall, the sound design is simple yet effective, giving the game a unique personality that matches its humorous tone.", "conclusion": "The Secret of Monkey Island is a masterpiece of adventure game design, blending witty humor, clever puzzles, and a charming story to create an unforgettable experience. Its unique gameplay mechanics, vibrant graphics, and memorable music have cemented it as one of the most iconic titles in gaming history. While the original’s lack of voice acting and relatively simple sound design might seem dated, the game’s timeless humor and storytelling continue to resonate with players today. For fans of adventure games and newcomers alike, The Secret of Monkey Island is a must-play classic that set the standard for interactive storytelling and remains a beloved gem in gaming history.", "rating": "8.5", "ano": 1990, "desenvolvedor": "Lucasfilm Games", "distribuidor": "Lucasfilm Games", "imagem": "0696b629-25dd-49dc-97ae-14ac7aff9417.jpg", "capa": "9e680da4-ef3f-45c1-8053-1aa550c61d8d.jpg", "video": "https://www.youtube.com/watch?v=tpZVWncjNig&t=111s", "generos": [2, 3]}}, {"model": "core.games", "pk": 16, "fields": {"criado": "2024-10-17", "modificado": "2024-11-21", "ativo": true, "game": "Wolfenstein 3D", "descricao": "Wolfenstein 3D, developed by id Software and released in 1992, is widely regarded as the game that popularized the first-person shooter genre. As B.J. Blazkowicz, an Allied spy trapped in a Nazi stronghold, players must shoot their way through floors of Castle Wolfenstein, eliminating enemy soldiers, mutant experiments, and ultimately facing off against notorious leaders. The game’s fast-paced action, innovative perspective, and simple yet effective gameplay loop introduced players to a new kind of immersive experience that has left a lasting legacy on gaming history.", "gameplay": "Wolfenstein 3D established the blueprint for what would become classic FPS gameplay. It is a straightforward but highly engaging experience focused on combat, exploration, and resource management. Players navigate maze-like corridors, collecting key cards to unlock doors, searching for secret rooms filled with treasure and health, and shooting enemies that become progressively more challenging. The goal is simple: survive, kill enemies, and find the exit to reach the next level.\r\n\r\nThe game’s controls are smooth and responsive, with a satisfying selection of weapons that includes a pistol, machine gun, and the powerful chain gun. Enemies range from basic guards to attack dogs and even powerful bosses, each with unique traits that keep players on their toes. Health and ammo are scarce, adding a layer of challenge and making careful movement and exploration essential. Though the gameplay is simplistic by today’s standards, it remains entertaining and easy to pick up, capturing the essence of classic run-and-gun fun.", "graphics": "For 1992, Wolfenstein 3D’s graphics were groundbreaking. Using a pseudo-3D perspective, the game introduced players to the feeling of moving through a 3D space, even if the visuals were technically flat. The environments are simple but effective, with distinct textures and bright colors that help orient players within the maze-like levels. Enemy sprites are well-animated for the time, and each level has a unique atmosphere that adds to the immersion. While Wolfenstein 3D’s graphics are understandably primitive by today’s standards, the retro aesthetic still has a unique charm, particularly for fans of early 90s PC gaming.", "sound_and_music": "The sound and music in Wolfenstein 3D are simple yet iconic. The soundtrack, composed by Bobby Prince, is a mix of militaristic and tense tracks that perfectly match the game’s WWII setting. While the music loops are short, they add a sense of urgency and build excitement as players progress through each level. Sound effects are memorable and include the classic gunfire, enemy shouts, and the satisfying “ding” when discovering secret rooms. Although minimalistic, the sound design effectively enhances the game’s atmosphere and keeps players engaged in the action.", "conclusion": "Wolfenstein 3D is a seminal title that laid the foundation for the modern FPS genre. Its straightforward yet addictive gameplay, memorable sound design, and revolutionary perspective were groundbreaking for its time and remain enjoyable even today. Although the graphics and mechanics may feel basic by contemporary standards, Wolfenstein 3D’s historical significance and unique charm make it a must-play for anyone interested in the roots of first-person shooters. It’s a testament to id Software’s innovation, and its influence on the gaming world is still felt today. For retro gaming fans or those curious about FPS history, Wolfenstein 3D offers a fun, nostalgic journey back to where it all began.", "rating": "8.0", "ano": 1992, "desenvolvedor": "Id software", "distribuidor": "id Software", "imagem": "b0d9f911-d9e1-4652-bbf6-616c2df97f47.jpg", "capa": "7f8a4e89-fa8d-46d3-b0d4-3849e68f3ccf.jpg", "video": "https://www.youtube.com/watch?v=x8o0a5ntxfc", "generos": [6]}}, {"model": "core.games", "pk": 17, "fields": {"criado": "2024-10-17", "modificado": "2024-11-21", "ativo": true, "game": "Close Combat", "descricao": "Close Combat, developed by Atomic Games and released in 1996, is a real-time tactics game set during World War II. Unlike many strategy games of its time, Close Combat emphasizes realistic tactics, psychological warfare, and morale over simple resource management or unit production. Players command squads of soldiers on the battlefield, guiding them through detailed environments while managing their mental and physical states in the heat of combat. Known for its groundbreaking approach to warfare realism, Close Combat quickly became a beloved title among strategy fans and is widely regarded as one of the most influential tactical games of the 90s.", "gameplay": "The gameplay in Close Combat focuses on realistic squad tactics, with an emphasis on positioning, cover, and morale. Rather than managing resources, players control squads of infantry and armored units, each with unique strengths, weaknesses, and morale levels. Soldiers react to their environment and circumstances: they take cover under fire, lose morale when surrounded, and even panic or retreat when overwhelmed. This makes every decision critical, as poor positioning or aggressive tactics can lead to severe consequences.\r\n\r\nClose Combat encourages players to think like a battlefield commander, emphasizing the importance of flanking maneuvers, suppressing fire, and using terrain to their advantage. Each mission has specific objectives, from holding a position to eliminating enemy forces, adding to the strategic depth of gameplay. The lack of unit reinforcements makes each soldier’s life valuable, pushing players to make tactical decisions with caution and forethought. It’s a challenging experience, but for those who enjoy authentic, in-depth strategy, Close Combat is a rewarding and highly immersive game.", "graphics": "For 1996, Close Combat featured visually detailed and immersive graphics, presented from a top-down perspective with a tactical map layout. The battlefield environments are richly textured, with buildings, trees, rivers, and various forms of cover that add to the realism of the gameplay. The units themselves are small and simple in appearance but move fluidly across the map, giving players a clear view of the action and allowing them to focus on strategic positioning rather than flashy visuals.\r\n\r\nAlthough dated by today’s standards, the graphics retain a certain charm and authenticity, particularly in how they capture the rugged, war-torn landscapes of World War II. The game’s visual style is functional and effective, providing the detail needed for tactical planning without overwhelming players with excessive effects.", "sound_and_music": "The sound design in Close Combat plays a significant role in creating an immersive battlefield atmosphere. The sounds of gunfire, explosions, and soldiers calling out orders are crisp and realistic, enhancing the sense of tension during combat. The voice work is particularly notable, as soldiers react to the changing conditions on the battlefield, providing feedback on their morale and calling for help when in distress. This adds an emotional layer to the game, making the soldiers feel like more than just units on a screen.\r\n\r\nThe music in Close Combat is minimal, allowing the sounds of battle to take center stage, which adds to the realism. The ambient audio reinforces the game’s immersive, tactical focus, making players feel like they are truly commanding soldiers on a chaotic battlefield.", "conclusion": "Close Combat is a groundbreaking tactical game that emphasizes realism, morale, and careful strategy over simple action. Its unique approach to warfare, which includes realistic soldier behavior, squad-based tactics, and morale management, set it apart from other strategy games of its time. Although the graphics may feel dated, the game’s attention to detail, sound design, and challenging gameplay make it a timeless experience for fans of realistic strategy games. Close Combat remains a classic in the genre, offering a challenging and immersive look at World War II combat that is still respected and enjoyed by fans of tactical gaming today. For those seeking a strategy game that prioritizes depth and realism, Close Combat is a must-play title.", "rating": "9.0", "ano": 1996, "desenvolvedor": "Atomic Games", "distribuidor": "Microsoft", "imagem": "04c2c38b-962d-4be4-b21d-9b5dacff3da7.jpg", "capa": "adee2174-a4e3-4bd5-a9d4-7341d449bcdd.jpg", "video": "https://www.youtube.com/watch?v=2xx_4b78yuc", "generos": [9]}}, {"model": "core.games", "pk": 18, "fields": {"criado": "2024-10-17", "modificado": "2024-11-21", "ativo": true, "game": "Close Combat: A Bridge Too Far", "descricao": "Close Combat: A Bridge Too Far, developed by Atomic Games and released in 1997, is the second entry in the Close Combat series and is widely regarded as a landmark title in tactical wargaming. Set during Operation Market Garden, one of the largest Allied operations of World War II, the game puts players in command of Allied or German forces fighting for control of key bridges in the Netherlands. With its focus on realistic tactics, morale-based gameplay, and attention to historical detail, Close Combat: A Bridge Too Far offers an immersive experience that brings the intensity and complexity of WWII combat to life.", "gameplay": "Close Combat: A Bridge Too Far retains the core mechanics of the original game but adds more depth and complexity. Players command squads of soldiers, tanks, and artillery, navigating them through maps based on real locations in the Netherlands. The game emphasizes tactical positioning, cover, and morale over brute force, challenging players to use realistic military strategies to overcome the enemy. Each soldier has individual morale, stamina, and experience levels, which influence how they respond to commands and combat situations. Troops can panic, retreat, or hold their ground depending on the intensity of the battle, creating an unpredictably realistic battlefield dynamic.\r\n\r\nThe campaign mode allows players to take command of either Allied or German forces, managing resources, reinforcements, and troop morale over a series of battles that reflect the historical sequence of Operation Market Garden. The game’s AI is challenging, requiring careful planning, flanking maneuvers, and the effective use of artillery and tank support. A Bridge Too Far rewards players for precise, cautious play, and punishes reckless actions, making every decision matter. For fans of historical accuracy and deep tactical gameplay, it offers a uniquely rewarding experience.", "graphics": "For 1997, Close Combat: A Bridge Too Far offers detailed isometric graphics that enhance its tactical gameplay. The environments are richly textured, with buildings, forests, rivers, and bridges that accurately reflect the historical settings. Each map is meticulously crafted, representing the Dutch terrain, towns, and strategic locations with a high degree of realism. The units, though small, are well-animated and respond fluidly, allowing players to see their movements and interactions on the battlefield clearly.\r\n\r\nWhile the graphics may feel dated today, they still effectively convey the tactical environment and add to the immersion. The visual detail on maps allows players to plan and execute their strategies more precisely, and the distinct WWII aesthetic captures the gritty atmosphere of the time.", "sound_and_music": "The sound design in Close Combat: A Bridge Too Far is atmospheric and impactful, with sound effects that enhance the realism of the combat experience. Gunfire, explosions, and the clanking of tank tracks create an immersive battlefield environment, while soldiers’ voices reflect their emotional states, calling out commands, panicking, or crying for help. This attention to audio detail adds an emotional layer, making each unit feel like more than just a tactical piece, but as individuals under pressure in the midst of combat.\r\n\r\nThe game features a minimal soundtrack, allowing the sounds of battle to take precedence. This approach creates a more intense atmosphere, as the ambient sounds immerse players in the chaos of war. The audio contributes greatly to the immersion, allowing players to feel the urgency and tension of each conflict without distracting background music.", "conclusion": "Close Combat: A Bridge Too Far is a masterclass in tactical wargaming, offering a challenging, realistic portrayal of WWII combat that remains one of the best in the genre. Its focus on realistic tactics, soldier morale, and historical accuracy provides a deeply immersive experience for players who appreciate strategy and detail. While the graphics may feel dated, the game’s meticulous attention to the authenticity of Operation Market Garden and its dynamic sound design make it a timeless experience. For those who value thoughtful, tactical gameplay and an accurate portrayal of WWII battles, Close Combat: A Bridge Too Far is a must-play classic that showcases the potential of historical wargaming.", "rating": "9.0", "ano": 1997, "desenvolvedor": "Atomic Games", "distribuidor": "Microsoft", "imagem": "4eb22e74-9d41-4d71-bb95-f93ac71d407f.jpg", "capa": "a138d7e7-435f-410c-945c-a3a49e107e74.jpg", "video": "https://www.youtube.com/watch?v=qkK1BSuBZ6w", "generos": [9]}}, {"model": "core.games", "pk": 19, "fields": {"criado": "2024-10-17", "modificado": "2024-11-21", "ativo": true, "game": "Alien Trilogy", "descricao": "Alien Trilogy, developed by Probe Entertainment and released in 1996, is a first-person shooter that brings the intense horror of the Alien film series to gaming. Loosely based on the events of the first three Alien movies, players assume the role of Ellen Ripley as she fights her way through environments overrun by xenomorphs and other hostile creatures. With its dark atmosphere, relentless action, and strong ties to the Alien universe, Alien Trilogy offers a blend of survival horror and shooter elements that captures the essence of the franchise.", "gameplay": "The gameplay in Alien Trilogy is a mix of fast-paced shooting and horror, with levels that encourage exploration while constantly keeping players on edge. Armed with iconic weapons such as the pulse rifle, flamethrower, and smart gun, players must fend off xenomorphs, facehuggers, and even human enemies. The game’s difficulty is high, with limited ammo and health pickups, requiring players to be strategic in managing resources. Each level is filled with corridors, vents, and dark rooms that create a tense atmosphere, where danger feels imminent around every corner.\r\n\r\nThe game’s level design, while linear, provides a sense of progression through familiar Alien environments, including claustrophobic tunnels, dark labs, and eerie colony buildings. Objectives often require players to find key items or clear areas of enemies, which can feel repetitive but serve the tense, survival horror pacing well. Despite its simplicity, Alien Trilogy’s gameplay is engaging, capturing the thrill and fear of the Alien universe effectively.", "graphics": "For 1996, Alien Trilogy’s graphics are atmospheric, using dark textures and low lighting to capture the oppressive and terrifying world of the Alien franchise. The environments are filled with gritty details that evoke the industrial, sci-fi setting of the movies, while the enemies are well-animated, especially the iconic xenomorphs that move and attack with unsettling ferocity. The game’s lighting is used effectively to create shadows and suspense, often making players feel vulnerable in dimly lit areas where enemies can appear without warning. Although the graphics may seem dated today, they still convey a strong, immersive aesthetic that captures the essence of the Alien films.", "sound_and_music": "The sound and music in Alien Trilogy contribute heavily to its eerie atmosphere. The soundtrack is minimalist, using ambient soundscapes and quiet, suspenseful tones to build tension, allowing the sounds of the environment and enemies to dominate. The xenomorphs’ hisses, the echo of footsteps in empty corridors, and the distinctive pulse of the pulse rifle all create a chilling audio experience that keeps players on edge. The sound design does a great job of making players feel isolated and vulnerable, much like the films. Overall, the audio is effective in building suspense and fear, intensifying the gameplay experience.", "conclusion": "Alien Trilogy successfully brings the tension, fear, and action of the Alien universe to life in a first-person shooter format. Its dark, claustrophobic environments, challenging gameplay, and atmospheric sound design create an experience that captures the essence of survival horror. While the repetitive objectives and dated graphics may detract slightly from the experience, Alien Trilogy remains a solid entry for fans of the Alien franchise and retro FPS games. It’s an intense, immersive journey that delivers on the thrill and terror of battling xenomorphs, making it a nostalgic yet satisfying homage to the films.", "rating": "8.0", "ano": 1996, "desenvolvedor": "Probe Entertainment", "distribuidor": "Acclaim Entertainment", "imagem": "c295e8e8-0c50-4c39-a3bb-ac013061d0b3.jpg", "capa": "7e0a5135-981b-4766-aaf6-0f9a09e72c5d.jpg", "video": "https://www.youtube.com/watch?v=0L5dDnVYMtE", "generos": [6]}}, {"model": "core.games", "pk": 20, "fields": {"criado": "2024-10-18", "modificado": "2024-11-21", "ativo": true, "game": "Ultima VIII: Pagan", "descricao": "Ultima VIII: Pagan, developed by Origin Systems and released in 1994, is the eighth installment in the Ultima series, a franchise that helped define the RPG genre. In Pagan, players continue their journey as the Avatar, now stranded on the world of Pagan—a harsh, dark land under the control of elemental Titans. The game breaks from the high-fantasy setting of previous Ultima titles, instead immersing players in a more mysterious and forbidding environment, where magic and survival play crucial roles. Though ambitious, Pagan was controversial for its departure from the series’ established mechanics and setting, making it one of the most polarizing entries in the Ultima series.", "gameplay": "Ultima VIII: Pagan shifts from the complex, party-based gameplay of its predecessors to a more action-oriented, single-character experience. Combat and exploration are now more fluid, with a greater emphasis on real-time movement and platforming. Players engage in battles with a variety of weapons and spells, often requiring precise timing and positioning due to the game’s real-time mechanics. The platforming elements are new to the series, adding jumping puzzles that sometimes feel difficult and unforgiving, as the controls can be challenging.\r\n\r\nThe game also introduces a revamped magic system that is integral to progression, as the Avatar learns spells tied to the elemental Titans governing Pagan. While the system is creative, it demands patience and careful experimentation, adding depth to the gameplay. However, the focus on action over traditional RPG elements left some longtime fans feeling alienated. Additionally, Pagan lacks the NPC interaction and complex moral choices that defined previous Ultima games, leaning more towards action and survival in a hostile environment.", "graphics": "For its time, Ultima VIII features impressive graphics, with an isometric perspective and richly detailed environments. Pagan’s dark landscapes, ominous temples, and eerie caverns capture the game’s foreboding tone and help establish its unique setting. The character and enemy sprites are well-animated, especially in combat, where attacks and spell effects are visually satisfying. Pagan’s graphics enhance the immersion, making the world feel alive yet bleak, fitting the game’s darker theme. Although the graphics have aged, Pagan retains a unique visual style that stands apart from other games of the era, and its atmosphere remains memorable.", "sound_and_music": "The sound and music in Ultima VIII contribute significantly to its atmosphere. The soundtrack, composed by Nenad Vugrinec and Todd Porter, is haunting and atmospheric, with music that intensifies during dangerous encounters and lingers quietly in moments of exploration. Sound effects are impactful, with satisfying clangs and spell sounds that add weight to combat. Ambient sounds, from the echoing wind to the chants and whispers in magical areas, further enrich the game’s dark, oppressive setting. Though subtle, the audio design works in tandem with the visuals to enhance the immersion and tension in the Avatar’s journey through Pagan.", "conclusion": "Ultima VIII: Pagan is an ambitious yet divisive entry in the Ultima series, offering a unique, action-oriented take on the beloved RPG franchise. Its departure from traditional Ultima mechanics, with a greater emphasis on combat, platforming, and a darker storyline, left many longtime fans disappointed. However, for those willing to embrace its new direction, Pagan offers an immersive and challenging experience set in a dark, fascinating world. Although not without its flaws—such as occasionally frustrating controls and a lack of the deep narrative choices that defined previous games—Ultima VIII remains an intriguing chapter in the Ultima series and a memorable exploration of a different kind of RPG adventure.", "rating": "7.5", "ano": 1994, "desenvolvedor": "ORIGIN Systems", "distribuidor": "ORIGIN Systems", "imagem": "4411a07b-7dd4-4312-87c6-f9a8fc21f636.jpg", "capa": "cfcbb322-f19d-46c4-9aa0-69c07b967008.jpg", "video": "https://www.youtube.com/watch?v=r9AaSIwGGys", "generos": [5]}}, {"model": "core.games", "pk": 21, "fields": {"criado": "2024-10-18", "modificado": "2024-11-21", "ativo": true, "game": "Return to Castle Wolfenstein", "descricao": "Return to Castle Wolfenstein, developed by Gray Matter Interactive and published by id Software in 2001, is a reboot of the classic Wolfenstein 3D. This time, players return as B.J. Blazkowicz, the iconic Allied spy, infiltrating Nazi strongholds to prevent occult experiments and supernatural threats from tipping the balance of World War II. Set against the sinister backdrop of Nazi-occupied Europe, Return to Castle Wolfenstein combines stealth, action, and horror elements to deliver a gripping first-person shooter experience that immerses players in its dark and suspenseful world.", "gameplay": "The gameplay in Return to Castle Wolfenstein is a blend of classic shooter mechanics with elements of stealth and exploration. Players can go guns-blazing through enemy strongholds or adopt a more stealthy approach, taking out guards quietly to avoid detection. This freedom of choice, along with the diverse mission objectives, keeps the gameplay engaging and encourages a mix of tactics. Players encounter a wide range of enemies, from standard Nazi soldiers to more bizarre creations like the undead and experimental super-soldiers, each requiring different strategies to defeat.\r\n\r\nThe game’s level design is another highlight, with a variety of richly detailed environments, from ancient catacombs to high-tech Nazi laboratories. The arsenal includes period-accurate weapons like pistols and rifles, as well as experimental firearms that add variety and a sense of progression as players advance through increasingly challenging levels. Multiplayer mode also offers classic team-based modes that kept players engaged long after the main story, making Return to Castle Wolfenstein popular in competitive circles.", "graphics": "For 2001, Return to Castle Wolfenstein was visually impressive, utilizing the id Tech 3 engine to deliver detailed environments and characters with realistic lighting and textures. The graphics capture the game’s eerie atmosphere, with dimly lit corridors, crumbling ruins, and dark forests that feel authentic to the era and unsettling. The character animations are fluid, and the attention to detail in both the level design and enemy models contributes to the overall immersion. While the visuals have aged, they retain a unique charm that enhances the game’s gothic and ominous mood, especially for players who appreciate classic shooters.", "sound_and_music": "The sound design in Return to Castle Wolfenstein plays a critical role in building tension and setting the atmosphere. Ambient sounds like footsteps echoing in dark corridors, the distant chants of Nazis, and the eerie groans of supernatural creatures all work to immerse players in the environment. The soundtrack is subtle yet effective, blending orchestral and atmospheric pieces that underscore the game’s dark themes. The weapons sound powerful and satisfying, and the voice acting, especially the grunts and taunts of the enemy soldiers, adds personality to each encounter. The audio elements make the game feel immersive and suspenseful, enhancing both the action and the horror.", "conclusion": "Return to Castle Wolfenstein is a thrilling blend of action, horror, and stealth that successfully reimagines the original Wolfenstein experience for a new generation. Its engaging gameplay, atmospheric visuals, and immersive sound design make it a standout title in the FPS genre, with a story and setting that bring historical intrigue and supernatural suspense together seamlessly. Though certain aspects may feel dated by today’s standards, Return to Castle Wolfenstein remains a beloved classic that continues to resonate with fans of WWII and horror-themed shooters.", "rating": "9.0", "ano": 2001, "desenvolvedor": "Gray Matter Interactive", "distribuidor": "id Software", "imagem": "509ae95d-3322-49c6-bd58-8ffc134903a9.jpg", "capa": "f7a26a9f-c105-42b1-855e-493e736bc7b1.jpg", "video": "https://www.youtube.com/watch?v=sHdBHeDjAY0", "generos": [6]}}, {"model": "core.games", "pk": 22, "fields": {"criado": "2024-10-25", "modificado": "2024-11-18", "ativo": true, "game": "The Beast Within: A Gabriel Knight Mystery", "descricao": "The Beast Within: A Gabriel Knight Mystery, developed by Sierra On-Line and released in 1995, is the second installment in the Gabriel Knight series. This FMV (full-motion video) adventure game follows Gabriel Knight, an author and Schattenjäger (Shadow Hunter), as he investigates a string of mysterious murders in Germany that may be linked to werewolves. Taking advantage of live-action performances, The Beast Within combines supernatural suspense with historical intrigue, weaving a dark, immersive story that captures players’ attention from the very beginning. Known for its strong narrative and atmospheric setting, this game remains a standout in the FMV adventure genre.", "gameplay": "The Beast Within employs classic point-and-click mechanics, enhanced by FMV sequences that immerse players in its cinematic storytelling. The gameplay revolves around puzzle-solving, dialogue choices, and exploration, as players control both Gabriel and his partner, Grace Nakimura, switching between them to unravel the mystery. The puzzles are challenging and often tied to historical and cultural details, requiring players to carefully examine their surroundings, search for clues, and piece together complex solutions.\r\n\r\nThe dual-character mechanic adds depth, allowing players to see different perspectives and approach the investigation in varied ways. Gabriel’s sections are often more action-driven and dramatic, while Grace’s segments involve research and puzzle-solving, creating a balanced dynamic. The Beast Within relies heavily on its storyline to drive the gameplay, offering an engaging experience that mixes investigation with supernatural horror.", "graphics": "For a game from 1995, The Beast Within boasts impressive visuals thanks to its full-motion video format, with real actors bringing the characters to life in live-action scenes. Although limited by the technology of the time, the FMV sequences lend a film-like quality to the game, giving it a unique look that distinguishes it from other adventure games of the era. The locations—ranging from German villages to grand castles and dark forests—are carefully crafted, contributing to the eerie, Gothic atmosphere that defines the game. While the low-resolution video quality might feel dated, it also gives the game a retro charm that fits its moody, atmospheric tone.", "sound_and_music": "The sound design in The Beast Within is one of its greatest strengths. The soundtrack, composed by Robert Holmes, is hauntingly beautiful, blending orchestral and choral elements that reflect the game’s dark, supernatural themes. The music shifts between suspenseful and melancholic, enhancing the emotional impact of key scenes and adding tension during critical moments. Voice acting is central to the experience, with Dean Erickson delivering a memorable performance as Gabriel Knight and Joanne Takahashi as Grace. Though some lines may feel a bit melodramatic by today’s standards, the voice work contributes to the game’s immersive storytelling. The ambient sound effects, from the eerie howls in the distance to the subtle creaks and whispers, further heighten the atmosphere, making each location feel authentic and unsettling.", "conclusion": "The Beast Within: A Gabriel Knight Mystery is a masterful blend of supernatural horror, historical intrigue, and interactive storytelling that stands as one of the high points of the FMV adventure genre. Its rich narrative, challenging puzzles, and atmospheric presentation make it an unforgettable experience for fans of point-and-click adventures. Although the FMV graphics may appear dated, the game’s powerful story, captivating soundtrack, and immersive atmosphere still hold up. The Beast Within is a must-play for those who appreciate story-driven games with a dark edge, and it remains a classic that showcases the potential of video games as a storytelling medium.", "rating": "8.0", "ano": 1995, "desenvolvedor": "Sierra On-Line", "distribuidor": "Sierra On-Line", "imagem": "7708e648-afc3-4069-a16e-7131571fdafc.jpg", "capa": "2905283e-5106-40d4-af3a-6b418261e156.jpg", "video": "https://www.youtube.com/watch?v=Q8sYYSJrx6c", "generos": [2]}}, {"model": "core.games", "pk": 23, "fields": {"criado": "2024-10-25", "modificado": "2024-11-21", "ativo": true, "game": "Microsoft Flight Simulator 2002", "descricao": "Microsoft Flight Simulator 2002, released by Microsoft in 2001, marked a significant leap in realism and accessibility for the iconic flight simulation series. Known for its dedication to detail, Flight Simulator 2002 introduced enhanced visuals, improved physics, and ATC (Air Traffic Control) communications, bringing players closer than ever to the experience of piloting a real aircraft. The game offers a range of aircraft to fly, from small private planes to commercial jets, and a world map filled with accurately rendered airports and cities. It’s a game designed for aviation enthusiasts, offering an immersive simulation experience that allows players to explore the skies with unprecedented freedom.", "gameplay": "Flight Simulator 2002’s gameplay is based on realistic flight mechanics, designed to replicate the challenges and intricacies of real-world flying. The game offers a steep learning curve, with controls that demand precision and an understanding of flight dynamics, making it both a rewarding and challenging experience. Players can choose from various flight missions or simply explore the world in Free Flight mode. Each plane has its unique handling characteristics, cockpit layout, and response to weather conditions, making every aircraft a new experience to master.\r\n\r\nOne of the game’s most innovative features is the introduction of ATC communications. Players can interact with AI-controlled ATC for guidance on takeoff, landing, and flight paths, adding an extra layer of immersion and authenticity. The game also includes dynamic weather and time settings, allowing players to experience different scenarios, from calm, sunny flights to turbulent, stormy landings. For beginners, Flight Simulator 2002 includes tutorials that teach the basics, but players who want a true simulation experience will find endless challenges in perfecting their flights.", "graphics": "For its time, Microsoft Flight Simulator 2002 offered impressive visuals, with detailed landscapes, realistic aircraft models, and weather effects that added depth to the flying experience. Major landmarks, cityscapes, and airports are rendered with high accuracy, providing a familiar and immersive world for players to explore. The game’s lighting and shading effects, particularly during sunrise and sunset, create breathtaking views that make flying in Flight Simulator 2002 visually rewarding. While the graphics may not hold up to modern standards, they still capture a sense of scale and realism that was groundbreaking in 2001, giving players a convincing representation of the world below.", "sound_and_music": "The sound design in Flight Simulator 2002 is subtle yet effective, focusing on engine sounds, cockpit noises, and ATC communications rather than music. Each aircraft has its unique engine hum, which changes as players adjust the throttle, creating an immersive audio experience that reflects the aircraft’s behavior. The ATC voices are clear and professional, enhancing the sense of realism and adding to the game's overall atmosphere. While there is no background music, the ambient sounds of the cockpit and environment add authenticity, making players feel like they are truly piloting an aircraft in various weather conditions.", "conclusion": "Microsoft Flight Simulator 2002 is a landmark in flight simulation, offering a realistic and immersive experience that appeals to aviation enthusiasts and simulation fans. Its attention to detail, combined with the new ATC feature, dynamic weather, and expansive world, provides a comprehensive and satisfying simulation. While the graphics and gameplay mechanics may feel dated by today’s standards, the game’s core experience remains engaging and accessible. Flight Simulator 2002 is a testament to the potential of realistic simulation games and holds a special place in the history of flight simulators, setting a high standard for realism and immersion that paved the way for future installments in the series.", "rating": "9.2", "ano": 2002, "desenvolvedor": "Microsoft Corporation", "distribuidor": "Microsoft Corporation", "imagem": "076af0bb-cdd5-4d91-ba17-e0841752d715.jpg", "capa": "8f7127db-6ca4-477a-9c80-9be2b6b1d29b.jpg", "video": "https://www.youtube.com/watch?v=s-XmUaZw77I", "generos": [7]}}, {"model": "core.games", "pk": 24, "fields": {"criado": "2024-10-31", "modificado": "2024-11-21", "ativo": true, "game": "Diablo", "descricao": "Diablo, developed by Blizzard Entertainment and released in 1996, is a dark action-RPG that helped define the genre, blending dungeon-crawling exploration with intense combat and character customization. Set in the dark fantasy world of Sanctuary, players descend into the catacombs beneath the town of Tristram to confront Diablo, the Lord of Terror. Diablo captivated players with its eerie atmosphere, randomized dungeons, and addictive loot system, creating a gameplay loop that remains influential even decades later.", "gameplay": "Diablo’s gameplay focuses on dungeon-crawling, combat, and loot collection. Players choose one of three character classes—Warrior, Rogue, or Sorcerer—each with unique abilities and playstyles. The game’s point-and-click mechanics are straightforward, making combat accessible yet challenging, especially as players progress to deeper, more dangerous levels filled with stronger enemies and traps. The core of Diablo’s appeal lies in its randomized dungeons and loot. Every playthrough offers different layouts, monsters, and treasures, encouraging players to explore, adapt, and continuously upgrade their equipment.\r\n\r\nThe game’s loot system is addictive, as players constantly find new weapons, armor, and magical items that enhance their character’s strength. While the story is linear, the experience is highly replayable due to the randomized elements and the increasing difficulty levels, which offer tougher challenges and greater rewards. Diablo also introduced cooperative multiplayer, allowing players to team up with friends and face the dark forces together, adding a social element that enhanced its longevity and appeal.", "graphics": "For 1996, Diablo boasted dark, atmospheric graphics that perfectly captured its Gothic horror setting. The isometric perspective offers a clear view of the environment, while the detailed pixel art and shadowed lighting create a sense of dread and isolation. The dungeons are richly designed, with intricate textures, blood-stained altars, and ominous, decaying structures that give a sense of impending danger. Each layer of the dungeon grows darker and more twisted, reflecting the progression toward Diablo’s lair.\r\n\r\nThe animations are smooth and effective, from the fluid motion of characters to the visceral effects of spells and attacks. The visual style, though dated by today’s standards, remains iconic, evoking a dark and immersive experience that holds up well for fans of retro gaming.", "sound_and_music": "The sound and music in Diablo are integral to its eerie, immersive atmosphere. The soundtrack, composed by Matt Uelmen, is haunting and memorable, featuring the iconic acoustic guitar theme in Tristram that has become synonymous with the series. The music shifts between ominous, foreboding tunes and tense, action-driven compositions that intensify as players delve deeper into the dungeons.\r\n\r\nSound effects, from the clang of metal weapons to the chilling growls of demons, further enhance the game’s sense of horror and danger. The sparse voice acting adds to the mystery, with townsfolk providing cryptic advice and warnings, building the story’s dark lore. Together, the sound and music create a richly atmospheric experience, drawing players into the depths of Sanctuary.", "conclusion": "Diablo is a timeless classic that laid the foundation for action RPGs, combining simple yet engaging combat with an addictive loot system and a dark, Gothic atmosphere. Its immersive gameplay, atmospheric graphics, and haunting sound design make it a must-play for fans of the genre and a landmark in gaming history. While the graphics and mechanics may feel dated to modern players, the game’s core experience is as engaging and rewarding today as it was in 1996. Diablo remains an influential and beloved title that set the standard for action RPGs and continues to inspire new generations of dungeon crawlers.", "rating": "8.8", "ano": 1996, "desenvolvedor": "Blizzard Entertainment", "distribuidor": "Blizzard Entertainment", "imagem": "69bb8acd-208d-4e0d-b1f6-91a8e556ecdc.jpg", "capa": "00da07e9-8764-485f-8162-cabc92cddae0.jpg", "video": "https://www.youtube.com/watch?v=ezE6vkmZzcU", "generos": [9, 5]}}, {"model": "core.games", "pk": 25, "fields": {"criado": "2024-11-01", "modificado": "2024-11-21", "ativo": true, "game": "The Dig", "descricao": "The Dig, developed by LucasArts and released in 1995, is a point-and-click adventure game that stands out for its science fiction storyline and mature, philosophical themes. Created with the involvement of Steven Spielberg, the game follows the journey of Commander Boston Low, who, along with a team of astronauts, is transported to a mysterious alien world while on a mission to destroy a massive asteroid heading toward Earth. The Dig combines adventure, mystery, and cosmic wonder, creating an experience that feels as much like an interactive sci-fi novel as it does a game.", "gameplay": "The Dig follows classic point-and-click adventure mechanics, where players control Commander Low and interact with the environment by exploring, collecting items, and solving puzzles. The gameplay leans heavily on logic-based puzzles that require observation and critical thinking, often integrated with the alien technology and environment that players must decipher to progress. The game is more challenging than most LucasArts titles, with puzzles that can feel complex and sometimes unforgiving, requiring patience and persistence.\r\n\r\nUnlike the humorous tone typical of other LucasArts adventures, The Dig takes a serious and contemplative approach, focusing on exploration and discovery. Dialogue choices allow players to learn more about the alien world and develop relationships with other characters, particularly scientists Brink and Robbins, whose interactions reveal different philosophical viewpoints. The pacing is slower than many adventure games, emphasizing immersion and mystery, drawing players deeper into the alien world and its secrets.", "graphics": "For 1995, The Dig featured impressive visuals, with beautifully rendered backgrounds and atmospheric environments that bring the alien world to life. The environments are richly detailed, ranging from eerie landscapes to futuristic, ancient structures that feel both familiar and otherworldly. The hand-drawn art style, combined with some pre-rendered elements, creates a cinematic look that captures the vastness and beauty of the alien world. Character animations are smooth, though simple, allowing players to focus more on exploration than action.\r\n\r\nThe game’s use of color and shadow adds to its mysterious atmosphere, giving each location a distinct tone that reflects the isolation and strangeness of the alien world. Though the graphics may look dated by modern standards, the art direction and design remain immersive and fitting for the game’s introspective sci-fi narrative.", "sound_and_music": "The sound and music in The Dig play a vital role in creating its haunting atmosphere. The soundtrack, composed by Michael Land, is orchestral and ambient, blending haunting melodies and eerie undertones that enhance the feeling of wonder and isolation. The music dynamically shifts to match the game’s pacing, intensifying during moments of discovery and becoming more subdued during scenes of exploration.\r\n\r\nVoice acting is top-notch, with actors like Robert Patrick delivering convincing performances that add depth to the characters. The voice acting, combined with realistic sound effects like echoing footsteps, hums of alien machinery, and whispers of wind, creates a fully immersive auditory experience. Together, the sound and music add a level of emotional resonance to the story, drawing players further into the narrative’s tension and mystery.", "conclusion": "The Dig is a thought-provoking and atmospheric adventure that offers a unique departure from typical LucasArts fare. Its challenging puzzles, mature themes, and beautifully crafted alien world make it a memorable experience for fans of science fiction and point-and-click adventures. While its slower pace and complex puzzles may not appeal to everyone, those who appreciate narrative depth and philosophical exploration will find it a rewarding journey. The Dig remains a classic in the adventure game genre, standing out for its storytelling and its ability to create a sense of awe and wonder, making it a must-play for fans of sci-fi narratives and timeless adventure games.", "rating": "8.9", "ano": 1995, "desenvolvedor": "LucasArts", "distribuidor": "LucasArts", "imagem": "05e8a0a3-d796-4d5d-a81f-94b3be28cb6d.jpg", "capa": "414b5637-a413-497c-8bbe-909fd292d019.jpg", "video": "https://www.youtube.com/watch?v=kTs2GIZVGoI", "generos": [2, 3]}}, {"model": "core.games", "pk": 26, "fields": {"criado": "2024-11-03", "modificado": "2024-11-21", "ativo": true, "game": "Warcraft II: Tides of Darkness", "descricao": "Warcraft II: Tides of Darkness, developed by Blizzard Entertainment and released in 1995, is a real-time strategy (RTS) game that brought the epic conflict between Orcs and Humans to a whole new level. Building on the foundation of the original Warcraft, Warcraft II introduced players to larger armies, naval battles, and more diverse factions, allowing them to experience the thrill of strategic warfare in the vibrant fantasy world of Azeroth. Its success cemented Blizzard's position in the RTS genre and helped shape the future of competitive gaming.", "gameplay": "Warcraft II’s gameplay revolves around resource management, base building, and commanding armies. Players choose to lead either the Human or Orc factions, each with its own units and buildings. They must gather resources, train troops, construct defenses, and manage an economy to defeat their opponents. The game introduced new mechanics, such as naval units and transports, which added strategic depth and required players to control both land and sea to secure victory. This made map exploration and defense planning crucial, as the enemy could strike from multiple fronts.\r\n\r\nThe variety of units, from powerful spellcasters to destructive catapults and ships, adds layers to the combat, where proper planning and unit positioning can turn the tide of battle. Each mission has different objectives, which keeps the gameplay fresh and engaging. Warcraft II also features a multiplayer mode, allowing players to battle friends in head-to-head matches, which was revolutionary for RTS gaming at the time and laid the groundwork for competitive online play.", "graphics": "For its time, Warcraft II was visually impressive, with colorful, hand-drawn sprites that brought the world of Azeroth to life. The 2D isometric graphics are richly detailed, with each faction’s units and buildings designed to reflect their unique cultures and styles. The animations are fluid, and battles are visually satisfying as units clash and spells flash across the battlefield. While the graphics are dated by modern standards, Warcraft II retains a charming, retro aesthetic that continues to be appreciated by fans of classic games.", "sound_and_music": "The sound and music in Warcraft II are memorable and immersive, enhancing the game’s fantasy atmosphere. The soundtrack, composed by Glenn Stafford, features orchestral music that captures the epic, medieval feel of the game, with tracks that vary in tone based on the faction. Each unit has unique voice lines that add personality and humor, like the Human Peasant’s “Yes, m’lord!” or the Orc Grunt’s gruff responses. The sound effects, from the clash of swords to the roar of catapults, add realism and excitement to battles, making the audio a core part of the Warcraft II experience.", "conclusion": "Warcraft II: Tides of Darkness is a timeless classic that set new standards for the RTS genre. Its engaging gameplay, strategic depth, and iconic audio-visual style make it one of the most memorable games of its era. While its mechanics may seem simple compared to modern RTS games, Warcraft II remains highly playable and enjoyable, offering a nostalgic experience that showcases Blizzard’s early mastery of game design. For fans of strategy games and classic gaming, Warcraft II is a must-play, standing as a key milestone in the evolution of real-time strategy.", "rating": "9.5", "ano": 1995, "desenvolvedor": "Blizzard Entertainment", "distribuidor": "Blizzard Entertainment", "imagem": "8ab7d814-09c4-425f-adcd-58ff041d6c19.jpg", "capa": "db1b139e-e14f-4b77-a553-59a7d9a04561.jpg", "video": "https://www.youtube.com/watch?v=KYzb2UvjFu8", "generos": [9]}}, {"model": "core.games", "pk": 27, "fields": {"criado": "2024-11-05", "modificado": "2024-11-21", "ativo": true, "game": "Full Throttle", "descricao": "Released in 1995 by LucasArts, Full Throttle is an iconic point-and-click adventure game that takes players into a gritty world of bikers and a dystopian future. With a storyline driven by rebellion, mystery, and revenge, the game puts players in the role of Ben, the leader of a biker gang called the Polecats. As Ben, you are wrongfully accused of murder and must clear your name while battling corporate greed and rival gangs. Full Throttle is a unique blend of adventure and action, leaving a strong impression on fans of both genres.", "gameplay": "Unlike traditional point-and-click games, Full Throttle integrates action elements with its adventure mechanics, creating a dynamic experience that’s both challenging and engaging. The gameplay relies on puzzles, quick decision-making, and occasional combat, where Ben uses his wits, fists, and bike to get out of sticky situations. The puzzles are cleverly designed, but some require specific timing, adding a layer of intensity not usually seen in adventure games of its era. However, the game remains accessible and rewards players for exploring and interacting with the world and characters.", "graphics": "For a game from the mid-90s, Full Throttle boasts impressive visuals with highly detailed, stylized artwork that captures the dark, industrial atmosphere of its setting. The hand-drawn animation and character designs hold up remarkably well, creating a comic book feel that’s both gritty and vibrant. The cutscenes, in particular, showcase LucasArts’ animation skills, giving the game a cinematic quality that was rare at the time. Even today, Full Throttle’s unique art style remains iconic and memorable.", "sound_and_music": "The sound design and music in Full Throttle play a huge role in setting its tone. The soundtrack, with its rock and heavy metal influences, perfectly complements the game’s biker culture and rebellious themes. The game also features voice acting from well-known actors like Mark Hamill, whose performance adds a lot of personality and depth to the characters. The roaring motorcycles, punches, and other sound effects are realistic and add to the game’s immersion, pulling players further into its gritty world.", "conclusion": "Full Throttle remains one of the most beloved classics in the adventure game genre. Its storytelling, unique style, and blend of action and puzzles create a memorable experience that stands the test of time. While relatively short in length, the game’s impact and charm continue to resonate with players. It’s an essential experience for fans of adventure games and a great introduction to the world of classic LucasArts storytelling.", "rating": "8.3", "ano": 1995, "desenvolvedor": "LucasArts", "distribuidor": "LucasArts", "imagem": "25e809cb-4503-4275-aacf-9a62377578c3.jpg", "capa": "516e8a7c-b9e3-45ad-bee2-31e93d392ccb.jpg", "video": "https://www.youtube.com/watch?v=ieml1wre8uw", "generos": [2, 3]}}, {"model": "core.games", "pk": 28, "fields": {"criado": "2024-11-11", "modificado": "2024-11-18", "ativo": true, "game": "Command & Conquer: Red Alert", "descricao": "Command & Conquer: Red Alert, released in 1996 by Westwood Studios, is a real-time strategy classic that immerses players in an alternate history where the Allies and the Soviets engage in intense warfare. Set against the backdrop of a Cold War gone hot, Red Alert builds on the success of the original Command & Conquer by adding more complex mechanics, improved AI, and a unique story that diverges from traditional military conflicts. The game lets players take control of each faction, experiencing different units, tactics, and storylines, all of which contribute to its long-lasting appeal in the RTS genre.", "gameplay": "The gameplay in Red Alert is classic RTS at its finest. Players gather resources, build bases, and deploy units in real-time to outmaneuver and defeat their enemies. Red Alert emphasizes strategic thinking, as players must balance resource management, base defense, and offensive tactics to succeed. Each faction offers unique units and abilities, encouraging different play styles; the Allies rely on advanced technology and speed, while the Soviets emphasize raw power and heavy armor. The mission variety, with objectives ranging from base destruction to stealth and sabotage, keeps gameplay engaging and rewarding. Multiplayer mode, a groundbreaking feature at the time, allows players to test their strategies against friends, adding significant replay value.", "graphics": "For its time, Command & Conquer: Red Alert had impressive visuals. The unit designs are crisp and distinctive, making it easy for players to differentiate between infantry, tanks, and aircraft, even during chaotic battles. Explosions and environmental details are portrayed with a stylized realism that maintains immersion. Although the graphics may seem outdated by today’s standards, the isometric view and pixel art style have a nostalgic charm that remains visually satisfying, enhancing the game's retro appeal.", "sound_and_music": "The soundtrack of Red Alert, crafted by Frank Klepacki, is unforgettable. Songs like \"Hell March\" perfectly encapsulate the intensity of war, infusing energy and excitement into every mission. Each unit comes with unique sound effects, from the rumble of tanks to the clinking of infantry footsteps, adding to the immersive battlefield environment. The voice acting, though somewhat exaggerated, adds charm and character, further distinguishing the two factions with Soviet and Allied accents that enhance the game’s thematic feel.", "conclusion": "Command & Conquer: Red Alert is a hallmark of the RTS genre, combining a rich, alternate history setting with gameplay that rewards tactical depth and strategic planning. Its unique blend of challenging missions, memorable music, and nostalgic visuals creates an experience that has stood the test of time. Whether revisiting or discovering it for the first time, players will find Red Alert a must-play classic that showcases the very best of 1990s RTS design.", "rating": "8.4", "ano": 1996, "desenvolvedor": "Westwood Studios", "distribuidor": "Electronic Arts", "imagem": "0f4d785a-9995-4739-98ed-70e1d22b139d.jpg", "capa": "5f1a7723-629f-45b5-9486-ae16c93969ba.jpg", "video": "https://www.youtube.com/watch?v=hAU8WuDoapg", "generos": [9]}}, {"model": "core.games", "pk": 29, "fields": {"criado": "2024-11-14", "modificado": "2024-11-20", "ativo": true, "game": "Silent Hunter", "descricao": "Silent Hunter, released in 1996, is a naval simulation game developed by Strategic Simulations, Inc. It immerses players into the world of submarine warfare during World War II, specifically placing them in control of an American submarine in the Pacific theater. Known for its realistic mechanics and detailed environments, Silent Hunter has earned its place as one of the best submarine simulations of its time.", "gameplay": "The gameplay in Silent Hunter is a blend of tactical decision-making and intense combat mechanics. As the captain, players have full control over the submarine’s operations, from managing the crew to plotting courses and engaging in combat. The game’s missions range from patrolling waters to intercepting and sinking enemy vessels, each requiring precise navigation and stealth. Torpedo attacks and surface artillery bring a layer of excitement, but players must remain vigilant about fuel and depth, adding to the overall challenge. For fans of military simulation, the game's attention to detail and realism is both engaging and rewarding, though the learning curve can be steep.", "graphics": "For a game released in 1996, the graphics in Silent Hunter are impressive and functional. The visual fidelity captures the dark, tense atmosphere of submarine warfare, with the underwater scenes effectively evoking the feeling of lurking beneath the ocean's surface. Ship models are adequately detailed for the era, with enough visual distinction to identify different vessel types. Though not spectacular by today’s standards, the graphics served their purpose well at the time, enhancing immersion without detracting from the gameplay.", "sound_and_music": "The sound design in Silent Hunter significantly adds to the immersion. The creaking hull of the submarine, the whir of the engines, and the sound of enemy sonar pings create an atmosphere thick with tension. Music is minimal, allowing the sounds of the submarine and the ocean to stand out, which feels fitting for the setting. The soundtrack is subtle but appropriate, never overwhelming the gameplay. These sound effects contribute to the sense of isolation and danger, making each dive and each attack feel high-stakes.", "conclusion": "Silent Hunter is a classic in the naval simulation genre, delivering an experience that combines historical authenticity with deep gameplay mechanics. It is not a game for those looking for fast-paced action; instead, it rewards patience, strategy, and careful planning. While the graphics and user interface may feel dated by modern standards, the core of the gameplay remains enjoyable, especially for enthusiasts of World War II history and simulation games. Silent Hunter successfully captures the suspense and danger of submarine warfare, making it a compelling experience worth revisiting.", "rating": "9.3", "ano": 1996, "desenvolvedor": "Aeon Electronic Entertainment", "distribuidor": "Strategic Simulations", "imagem": "6ec15d79-75c3-4406-b82f-b13eadad8635.jpg", "capa": "454ccf5c-a56c-484d-851f-ef00239a671b.jpg", "video": "https://www.youtube.com/watch?v=EzYySSvH4dI", "generos": [9, 7]}}, {"model": "core.games", "pk": 30, "fields": {"criado": "2024-11-18", "modificado": "2024-11-18", "ativo": true, "game": "F1 2002", "descricao": "F1 2002, developed by EA Sports, brings the high-octane action of Formula 1 racing to the PC with an official license. Released during the peak of the F1 era dominated by legendary drivers like Michael Schumacher, the game promises an authentic racing experience. But does it deliver on its potential? Let’s break it down.", "gameplay": "The gameplay is where F1 2002 truly shines. The handling strikes a fine balance between simulation and accessibility, allowing both casual players and hardcore F1 enthusiasts to enjoy the experience. The game offers a detailed career mode, quick races, and time trials. The inclusion of realistic pit stops, tire wear, and weather dynamics adds to the immersion. However, the AI can be inconsistent, at times feeling overly aggressive or sluggish, which can disrupt the realism.", "graphics": "For a game released in 2002, the graphics are impressive. The cars are accurately modeled, with vibrant liveries that reflect the teams of the era. The tracks are faithfully recreated, capturing the iconic circuits of the F1 calendar. However, the environmental textures and crowd animations feel dated by today’s standards. Despite this, the game’s graphical fidelity was a strong point for its time.", "sound_and_music": "The sound design is a mixed bag. The roar of the engines and the screeching tires are satisfying, bringing the intensity of F1 racing to life. However, the commentary and pit crew communications lack variety and can become repetitive. The soundtrack is generic and uninspiring, failing to match the adrenaline of the racing.", "conclusion": "F1 2002 remains a solid entry in the racing game genre and a nostalgic experience for fans of early 2000s Formula 1. While its graphics and sound design may feel dated, the gameplay still holds up well, offering an engaging mix of realism and accessibility. For F1 enthusiasts and retro gamers, it’s a title worth revisiting, but it might not fully satisfy modern racing game fans accustomed to today’s standards.", "rating": "8.9", "ano": 2002, "desenvolvedor": "Visual Science", "distribuidor": "Electronic Arts", "imagem": "034c96d9-75fe-4539-a492-fb863fa04c72.jpg", "capa": "ad4ccfd8-6a6b-4454-bf35-f3b8c32fc58f.jpg", "video": "https://www.youtube.com/watch?v=bB9TNKvsgcU", "generos": [8, 4, 7]}}, {"model": "core.games", "pk": 31, "fields": {"criado": "2025-01-14", "modificado": "2025-01-14", "ativo": true, "game": "Maniac Mansion", "descricao": "\"Maniac Mansion,\" released in 1987 by Lucasfilm Games, is a groundbreaking point-and-click adventure game that set the standard for interactive storytelling. Combining humor, a quirky plot, and innovative gameplay mechanics, it introduced the SCUMM engine, which would later power some of the most beloved adventure games of the 80s and 90s. The story revolves around Dave Miller and his friends attempting to rescue Dave's girlfriend, Sandy, from the clutches of a mad scientist, Dr. Fred Edison, in a spooky mansion filled with bizarre characters and puzzles.", "gameplay": "The gameplay in Maniac Mansion is revolutionary for its time, emphasizing player choice and exploration. Players control Dave and two other characters selected from a pool of six, each with unique skills that influence puzzle solutions and the game's progression. This character-based system adds replayability, as different combinations lead to varying outcomes. The point-and-click interface, though novel, is intuitive and quickly becomes second nature. The mansion itself is a maze of secrets, requiring keen observation, experimentation, and a sense of humor to unravel its mysteries. Some puzzles, however, can feel obscure, and players may find themselves stuck without clear guidance.", "graphics": "For a 1987 release, the graphics of Maniac Mansion are charming and functional, though limited by the technology of the era. The pixel art effectively conveys the eerie and whimsical atmosphere of the mansion. Each room has its unique personality, with colorful, cartoonish designs that complement the game's lighthearted tone. The character sprites, while simple, are expressive enough to add life to the quirky cast. The visuals have aged, but they still hold a nostalgic charm that fans of retro gaming can appreciate.", "sound_and_music": "The game's sound design is minimal but effective. The iconic opening theme, with its catchy and eerie melody, sets the stage perfectly. While there is no continuous background music during gameplay, the occasional sound effects—such as footsteps, door creaks, and environmental interactions—enhance the immersion. Given the hardware limitations of the time, the audio succeeds in delivering a unique atmosphere, though modern players may find it sparse compared to contemporary standards.", "conclusion": "Maniac Mansion is a timeless classic that laid the groundwork for the golden age of adventure games. Its humor, creativity, and innovation continue to resonate with players even decades after its release. While some puzzles can be frustratingly obtuse and the graphics and sound show their age, these quirks are part of the charm that defines the game. Whether you're a fan of retro gaming or new to the genre, Maniac Mansion remains a must-play title for its historical significance and sheer entertainment value.", "rating": "9.0", "ano": 1987, "desenvolvedor": "Lucasfilm Games", "distribuidor": "Lucasfilm Games", "imagem": "ea44e488-ace8-4484-b657-148cee77fdfa.jpg", "capa": "024da87e-d22a-4d81-be64-9c8f8085550f.jpg", "video": "https://www.youtube.com/watch?v=HO8IuwtH9VA", "generos": [2]}}, {"model": "core.games", "pk": 32, "fields": {"criado": "2025-01-16", "modificado": "2025-01-16", "ativo": true, "game": "Star Wars: Jedi Knight - Dark Forces II", "descricao": "Released in 1997 by LucasArts, Star Wars: Jedi Knight - Dark Forces II is the sequel to the acclaimed Dark Forces. This game blends first-person shooting with third-person combat, introducing lightsabers and Force powers as core gameplay elements. Set in the rich Star Wars universe, it follows Kyle Katarn, a former soldier-turned-mercenary, on a journey to avenge his father's death while uncovering his connection to the Force and battling the Sith Lord Jerec and his dark followers.", "gameplay": "Jedi Knight builds upon its predecessor by incorporating lightsabers and Force powers alongside traditional firearms. Players experience a hybrid gameplay style, switching between first-person shooting for ranged weapons and third-person perspective during lightsaber combat.\r\n\r\nThe game offers moral choices, allowing players to align with either the Light Side or the Dark Side of the Force. This alignment unlocks unique abilities that impact both gameplay strategies and the story’s progression. The skill system lets players enhance Force powers like Push, Choke, and Heal, adding depth and customization.\r\n\r\nLevels are expansive, encouraging exploration, puzzle-solving, and strategic combat. From Imperial bases to ancient Jedi temples, the environments are diverse and imbued with Star Wars charm.\r\n\r\nHighlights:\r\n\r\nDynamic lightsaber combat.\r\nA variety of weapons and Force abilities.\r\nMoral decisions that shape Kyle’s destiny.", "graphics": "For a 1997 game, Jedi Knight impresses with its fully 3D environments and detailed character models for its time. While the graphics engine shows its age today, it delivers realistic textures and a sense of scale, especially in grand locations like towering Jedi temples and sprawling industrial facilities.\r\n\r\nThe art direction faithfully captures the Star Wars aesthetic, using atmospheric lighting and architecture that feels authentic to the universe. The live-action FMV (Full Motion Video) cutscenes, though dated by modern standards, add a nostalgic charm to the storytelling.", "sound_and_music": "The sound design is a standout feature. Iconic sound effects, such as the hum of lightsabers and the blaster fire, immerse players in the Star Wars universe. Voice acting, though limited, is solid and enhances the narrative.\r\n\r\nThe soundtrack is a mix of original compositions and John Williams’ legendary Star Wars themes. The orchestral music dynamically shifts to match the action, enhancing the emotional weight of battles and exploration.", "conclusion": "Star Wars: Jedi Knight - Dark Forces II is a landmark game that successfully merges Star Wars lore with engaging gameplay. Its mix of first-person shooting, lightsaber duels, and Force mechanics set a new standard for action-adventure games in the late 1990s. Despite dated visuals and clunky controls by today’s standards, the game remains a beloved classic for fans of the galaxy far, far away.", "rating": "9.0", "ano": 1997, "desenvolvedor": "LucasArts", "distribuidor": "LucasArts", "imagem": "922882cf-af05-4095-b2a6-42998a1cb72b.jpg", "capa": "011d7bca-4040-4368-b84f-db6a64456b59.jpg", "video": "https://www.youtube.com/watch?v=I1XPOb6Ivf0", "generos": [6]}}, {"model": "core.games", "pk": 33, "fields": {"criado": "2025-01-20", "modificado": "2025-01-20", "ativo": true, "game": "Kings of the Beach", "descricao": "Kings of the Beach, developed by Electronic Arts and released in 1988, brought the thrill of beach volleyball to PC gamers. Featuring renowned volleyball players Sinjin Smith and Randy Stoklos, the game captures the competitive spirit of the sport with surprising depth for its time. With a blend of fast-paced action and strategic gameplay, Kings of the Beach stands out as a memorable sports title from the late 80s.", "gameplay": "The gameplay of Kings of the Beach strikes a balance between simplicity and challenge. Players control a two-player team in matches that range from casual to increasingly competitive as the game progresses. The controls are intuitive, featuring a mix of basic moves like passing and setting, alongside advanced techniques such as spiking and blocking.\r\n\r\nOne standout feature is the game’s focus on strategy. Timing is critical, and positioning your players correctly is essential to outmaneuvering opponents. The game offers both single-player and multiplayer modes. The single-player tournament mode provides a satisfying progression, while the multiplayer mode (when played via local setup) elevates the experience with its cooperative or competitive play.\r\n\r\nDespite its depth, the AI can sometimes feel repetitive, and the lack of modern save mechanics means players must complete tournaments in one session, adding a layer of retro-style difficulty.", "graphics": "For a game from 1988, the graphics on the PC are quite functional and colorful. The sandy courts, animated crowd, and character sprites, though pixelated by modern standards, effectively capture the beach setting. The animations are smooth, especially when players dive or execute powerful spikes. However, the limited variety of environments may leave players wanting more visual diversity after extended play.", "sound_and_music": "The PC version of Kings of the Beach features basic sound effects and MIDI-style music typical of its era. The music tracks, while repetitive, add an upbeat and energetic vibe to matches. Sound effects, such as the bounce of the volleyball or crowd cheers, provide an added layer of immersion, though they can feel sparse by today’s standards. The lack of variety in the audio design may cause it to fade into the background during longer sessions.", "conclusion": "Kings of the Beach for PC is a classic sports title that offers a fun and challenging take on beach volleyball. Its straightforward controls, strategic gameplay, and competitive multiplayer make it a standout experience for its time. While the graphics and sound may feel dated, the game’s charm and replayability ensure it remains an enjoyable retro experience for fans of classic PC gaming.", "rating": "9.0", "ano": 1988, "desenvolvedor": "Electronic Arts", "distribuidor": "Electronic Arts", "imagem": "fd30d2fe-8537-4a9f-be6b-8b4326641f08.jpg", "capa": "1292bee9-45a5-4b75-b40e-fd2598c33eee.jpg", "video": "https://www.youtube.com/watch?v=X-FnQLVO4IU", "generos": [8]}}, {"model": "core.games", "pk": 34, "fields": {"criado": "2025-01-21", "modificado": "2025-01-22", "ativo": true, "game": "Counter-Strike", "descricao": "Released in 2000 as a mod for Half-Life, Counter-Strike quickly revolutionized the first-person shooter genre. Created by Minh \"Gooseman\" Le and Jess Cliffe, the game emphasizes tactical team-based gameplay, pitting Terrorists against Counter-Terrorists in thrilling objectives like bomb planting or hostage rescue. Its minimalist approach and competitive nature set it apart from other games of the era, creating a legacy that continues to influence modern gaming.", "gameplay": "Counter-Strike’s gameplay is its strongest feature. Matches are intense, with players requiring strategy, communication, and precision. Each round is short, adding a sense of urgency to every decision, whether it’s purchasing weapons, choosing routes, or coordinating attacks. The economic system, where players earn money for completing objectives or eliminating enemies, adds depth to the gameplay, forcing teams to manage resources effectively. While the learning curve is steep, the satisfaction of mastering mechanics like weapon recoil or tactical positioning is unparalleled.", "graphics": "Although not groundbreaking for its time, Counter-Strike’s visuals were functional and effective. Built on the GoldSrc engine, the game featured clean and straightforward maps that prioritized gameplay clarity over graphical flair. Iconic maps like Dust2 and Inferno became staples due to their balance and design. While the textures and models may appear dated today, they served their purpose, ensuring players could quickly identify enemies and navigate the environment without distractions.", "sound_and_music": "Counter-Strike’s sound design played a pivotal role in its gameplay. From the distinct footstep sounds to the echo of gunfire, every audio cue provided critical information about enemy locations and actions. The weapons had satisfying and recognizable sound effects, adding to the game’s immersion. However, the lack of a traditional soundtrack meant players relied entirely on these auditory cues, which became integral to the game’s tension-filled atmosphere.", "conclusion": "Counter-Strike is a timeless classic that laid the groundwork for competitive multiplayer shooters. Its combination of strategic depth, skill-based mechanics, and community-driven content solidified its place in gaming history. While its graphics may feel outdated, the core gameplay remains as compelling today as it was in 2000. Counter-Strike isn’t just a game; it’s a cultural phenomenon that continues to inspire and challenge gamers worldwide. For fans of tactical shooters, it’s an absolute must-play.", "rating": "9.0", "ano": 2000, "desenvolvedor": "Valve", "distribuidor": "Valve", "imagem": "96c0ebd0-0eb6-4908-b65c-c9464e8b7e66.jpg", "capa": "56e54042-8f38-4ab6-a94d-31a42aad19bc.jpg", "video": "https://www.youtube.com/watch?v=s9kb7_k8Wlc", "generos": [6]}}, {"model": "core.games", "pk": 35, "fields": {"criado": "2025-01-22", "modificado": "2025-01-22", "ativo": true, "game": "Delta Force 2", "descricao": "Released in 1999, Delta Force 2 by NovaLogic is a tactical first-person shooter that builds upon the foundation laid by its predecessor. The game places players in the boots of elite Delta Force operatives, tasked with carrying out dangerous and covert missions worldwide. Known for its use of voxel-based graphics and realistic gameplay mechanics, Delta Force 2 was a standout title for fans of military simulations.", "gameplay": "The core of Delta Force 2 lies in its emphasis on realism. Unlike traditional arcade shooters, the game rewards strategic thinking, precision, and stealth. Missions range from reconnaissance and sabotage to hostage rescues, providing a variety of objectives. Players have access to a wide arsenal of weapons, from sniper rifles to explosives, each feeling distinct and tailored to specific scenarios.\r\nThe large, open maps allow for diverse tactical approaches, letting players choose between stealthy infiltrations or direct assaults. Enemy AI is relatively advanced for its time, making foes challenging and reactive to player actions. Multiplayer mode also shines, offering intense team-based gameplay with modes like Capture the Flag and Deathmatch.", "graphics": "Delta Force 2 uses NovaLogic's Voxel Space engine, which allows for expansive terrains and vast outdoor environments. While the graphics may appear dated by modern standards, the engine's ability to render massive maps with varied terrain was revolutionary in 1999. The visual fidelity of characters and objects, however, feels simplistic, with blocky models and limited texture detail. Despite this, the game’s focus on realism is enhanced by immersive landscapes that feel functional and believable.", "sound_and_music": "The sound design in Delta Force 2 is utilitarian, prioritizing realism. The sharp crack of gunfire, the distant rumble of vehicles, and environmental sounds like wind and footsteps contribute to a sense of immersion. The music is minimal, allowing ambient sound to take center stage, emphasizing the tension and focus required in each mission. While the lack of a dynamic soundtrack might make the game feel less cinematic, it aligns with the game’s military simulation focus.", "conclusion": "Delta Force 2 is a game that prioritizes tactical gameplay and immersion over flashy visuals or explosive action. Its open-ended mission design, vast terrains, and emphasis on realism make it a unique experience, especially for fans of military simulations. While the voxel-based graphics and minimalistic sound design might feel outdated by today’s standards, they were groundbreaking in their time. The game’s multiplayer mode adds replayability, ensuring its legacy as a classic in the tactical shooter genre.\r\nFor those seeking a methodical and challenging FPS, Delta Force 2 is a must-play that holds a special place in gaming history.", "rating": "8.0", "ano": 1999, "desenvolvedor": "NovaLogic", "distribuidor": "NovaLogic", "imagem": "4f19e26b-167f-462c-8be9-6f35b7d855b8.jpg", "capa": "96f1f02c-5c37-43ee-8f2e-43bfb2a36b0e.jpg", "video": "https://www.youtube.com/watch?v=rriyXZ0fwP0", "generos": [6]}}, {"model": "core.games", "pk": 36, "fields": {"criado": "2025-01-27", "modificado": "2025-01-27", "ativo": true, "game": "Alone in the Dark", "descricao": "Released in 1992 by Infogrames, Alone in the Dark is widely regarded as the grandfather of the survival horror genre. Drawing inspiration from H.P. Lovecraft's Cthulhu Mythos and classic horror films, the game offers a spine-chilling experience set in the haunted Derceto mansion. Its innovative blend of 3D graphics, atmospheric storytelling, and puzzle-solving elements set a benchmark for future games in the genre.", "gameplay": "The gameplay of Alone in the Dark revolves around exploration, survival, and puzzle-solving. Players can choose between Edward Carnby, a private investigator, or Emily Hartwood, a woman searching for answers about her uncle’s mysterious death. Both characters navigate through the eerie mansion, avoiding or fighting supernatural entities while solving challenging puzzles.\r\n\r\nCombat mechanics are simplistic but effective, with a mix of melee and ranged weapons to fend off enemies. However, combat isn’t the primary focus; resource management and clever problem-solving are essential for survival. The tank controls, while innovative at the time, can feel clunky by modern standards, but they add to the tension as every movement feels deliberate.", "graphics": "For its time, Alone in the Dark was groundbreaking in its use of 3D polygonal characters within pre-rendered 2D backgrounds. The mansion is meticulously designed, with each room contributing to the game’s oppressive atmosphere. While the visuals are dated by today’s standards, they remain impressive as an early example of 3D rendering in gaming. The fixed camera angles enhance the suspense, often obscuring dangers until it’s too late.", "sound_and_music": "The sound design in Alone in the Dark is another highlight. The eerie silence is frequently broken by unsettling creaks, howls, and footsteps, immersing the player in a world of dread. The musical score is sparse but effective, with dramatic stings accompanying enemy encounters and haunting melodies amplifying the sense of isolation. The minimalist approach to sound and music perfectly complements the game’s horror themes.", "conclusion": "Alone in the Dark is a trailblazer that laid the foundation for survival horror classics like Resident Evil and Silent Hill. While its controls and visuals may feel dated, the game’s atmosphere, innovative gameplay, and gripping narrative make it a must-play for fans of the genre. It’s a testament to the power of creativity and technical ambition in early gaming.", "rating": "7.0", "ano": 1992, "desenvolvedor": "Infogrames", "distribuidor": "Infogrames", "imagem": "414f1245-1013-42b9-828e-6292df755ba6.jpg", "capa": "cc8bdf8f-8a25-409c-b16c-e47d2c3027e8.jpg", "video": "https://www.youtube.com/watch?v=fX5uRNAieVA", "generos": [2, 3]}}, {"model": "core.games", "pk": 37, "fields": {"criado": "2025-01-29", "modificado": "2025-01-29", "ativo": true, "game": "System Shock 2", "descricao": "When System Shock 2 was released in 1999, it quickly became a cult classic, blending first-person shooting, RPG mechanics, and survival horror elements into a truly immersive experience. Developed by Irrational Games and Looking Glass Studios, the game was ahead of its time in terms of storytelling, atmosphere, and gameplay depth. Even today, System Shock 2 remains one of the most influential titles in gaming history, inspiring games like BioShock and Deus Ex.", "gameplay": "At its core, System Shock 2 is a hybrid of FPS and RPG elements, allowing players to choose from three different career paths: Marine (combat-focused), Navy (hacking and technical skills), and OSA (psionic abilities). The game takes place on the Von Braun, a deep-space starship plagued by an unknown biological threat. The combination of exploration, resource management, and strategic decision-making adds tension, making every encounter feel meaningful. The RPG progression system, which lets players improve their hacking, weapon skills, and psionic abilities, ensures a high degree of replayability. The game’s survival horror aspect is reinforced by limited ammunition and scarce resources, forcing players to think before they act.", "graphics": "For a 1999 title, System Shock 2 showcased impressive visuals, especially in terms of level design and environmental storytelling. While the character models and textures are noticeably dated by today’s standards, the eerie atmosphere and well-crafted lighting effects still manage to create a sense of dread. The game's use of environmental storytelling, with blood-stained corridors, flickering lights, and abandoned logs, adds to the immersion.", "sound_and_music": "The game’s sound design is one of its strongest aspects. The chilling whispers, distant screams, and unsettling noises keep players on edge throughout the experience. The voice acting, particularly the menacing presence of SHODAN, remains iconic and contributes significantly to the game’s horror atmosphere. The soundtrack is a mix of electronic and ambient tones, enhancing the feeling of isolation and impending doom.", "conclusion": "System Shock 2 is a masterpiece that pushed the boundaries of storytelling and gameplay in the late '90s. Despite its aged graphics and somewhat clunky mechanics, the game’s deep RPG elements, immersive atmosphere, and gripping horror make it an essential experience for fans of sci-fi and survival horror. If you can look past its dated visuals, you’ll find a game that still holds up remarkably well and continues to influence modern titles. Whether you're a veteran or a newcomer, System Shock 2 is a must-play classic.", "rating": "9.0", "ano": 1999, "desenvolvedor": "Looking Glass Studios", "distribuidor": "Electronic Arts", "imagem": "73629332-aa83-4c2c-8eda-f0e20e7f03c3.jpg", "capa": "81f8a07e-1c38-4337-81b6-c215f4a3c71b.jpg", "video": "https://www.youtube.com/watch?v=c5dHeGTBKfo", "generos": [5, 6]}}, {"model": "core.games", "pk": 38, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "game": "Outlaws", "descricao": "Released in 1997 by LucasArts, Outlaws is a first-person shooter (FPS) that stands out for its Wild West setting. Developed by the same team behind classics like Dark Forces, the game combines intense action, an engaging narrative, and an authentic Western atmosphere. With 2.5D graphics for its time, a memorable soundtrack, and solid gameplay, Outlaws earned a special place in the hearts of FPS and Western fans alike.", "gameplay": "The gameplay of Outlaws revolves around gunfights using classic Wild West weapons like revolvers, shotguns, and dynamite. Players take on the role of Marshal James Anderson, a former sheriff on a quest for revenge to rescue his family, kidnapped by outlaws. The game offers a variety of missions, ranging from duels in dusty streets to ambushes in caves and trains.\r\n\r\nControls: The controls are simple and intuitive, making it easy to aim, shoot, and interact with the environment.\r\n\r\nWeapons: Each weapon feels unique, with a satisfying sense of impact. The iconic Colt Single Action Army revolver is a fan favorite.\r\n\r\nLevel Design: The levels are well-crafted, offering a mix of open areas and tight corridors, encouraging exploration and strategic combat.\r\n\r\nDuel Mode: A standout feature is the \"Quick Draw\" duel mode, where players must rely on reflexes and precision to outdraw opponents.", "graphics": "For its time, Outlaws delivered impressive 2.5D graphics using the Jedi Engine (also used in Dark Forces). While the textures and character models may seem dated by today's standards, the art direction captures the essence of the Wild West perfectly. The environments, such as saloons, deserts, and ghost towns, are richly detailed and immersive. The game also uses dynamic lighting and weather effects, which were quite advanced for the mid-90s.", "sound_and_music": "The sound design in Outlaws is exceptional. The gunshots, footsteps, and ambient noises (like wind and animal sounds) create an immersive Western experience. The voice acting, particularly for Marshal Anderson and the villains, adds depth to the story.\r\n\r\nThe soundtrack, composed by Clint Bajakian, is one of the game's highlights. The main theme, a haunting and melancholic orchestral piece, perfectly sets the tone for the game. The music dynamically changes during combat, ramping up the tension and excitement.", "conclusion": "Outlaws is a timeless classic that successfully blends the FPS genre with the Wild West setting. Its engaging story, satisfying gameplay, and atmospheric presentation make it a must-play for fans of retro shooters and Westerns. While the graphics may show their age, the game's charm and attention to detail ensure it remains a beloved title in gaming history. If you're looking for a nostalgic trip or a unique FPS experience, Outlaws is well worth your time.", "rating": "8.5", "ano": 1997, "desenvolvedor": "LucasArts", "distribuidor": "LucasArts", "imagem": "5a323989-f9ec-4afe-b340-2da799947c0f.jpg", "capa": "20228e1e-22ec-4cc6-ab35-392e8a07464c.jpg", "video": "https://www.youtube.com/watch?v=9n4ghEkKV-Q", "generos": [6]}}, {"model": "core.games", "pk": 39, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "game": "Call of Duty", "descricao": "Released in 2003 by Infinity Ward and published by Activision, Call of Duty revolutionized the first-person shooter (FPS) genre by bringing a cinematic and immersive World War II experience to PC gamers. As one of the most influential shooters of its time, it set new standards for storytelling, gameplay, and multiplayer. Even today, it remains a beloved classic for its intense action and historical authenticity.", "gameplay": "The gameplay of Call of Duty is fast-paced, intense, and highly immersive. Unlike other shooters of its time, it focuses on squad-based combat, where players feel like part of a larger battle rather than a lone hero. Key features include:\r\n\r\nMultiple Perspectives: The campaign allows players to experience the war through the eyes of three soldiers: an American paratrooper, a British SAS operative, and a Soviet infantryman. This variety keeps the gameplay fresh and engaging.\r\n\r\nRealistic Combat: The game emphasizes realism with authentic weapons, limited health regeneration (via medkits), and a focus on tactics rather than run-and-gun gameplay.\r\n\r\nScripted Events: The game uses scripted sequences to create cinematic moments, such as dodging sniper fire in Stalingrad or storming the beaches of Normandy.\r\n\r\nMultiplayer: The multiplayer mode, though simpler than modern titles, was groundbreaking at the time, offering team-based modes like Search and Destroy and Team Deathmatch.\r\n\r\nThe gameplay is challenging but rewarding, with a perfect balance of action and strategy.", "graphics": "For its time, Call of Duty was a visual masterpiece. Built on the id Tech 3 engine (the same engine used in Quake III Arena), the game featured:\r\n\r\nDetailed Environments: From the bombed-out streets of Stalingrad to the French countryside, the game’s environments were richly detailed and immersive.\r\n\r\nRealistic Animations: Character movements, weapon handling, and explosions were all highly polished for 2003.\r\n\r\nAtmospheric Effects: Dynamic lighting, smoke, and weather effects added to the realism and intensity of the battles.\r\n\r\nWhile the graphics may look dated by today’s standards, they were cutting-edge at the time and still hold up well for a 20-year-old game.", "sound_and_music": "The sound design in Call of Duty is one of its standout features, contributing significantly to the immersion:\r\n\r\nWeapon Sounds: Each gun has a distinct and realistic sound, from the iconic M1 Garand ping to the thunderous MG42.\r\n\r\nVoice Acting: The voice work is excellent, with soldiers shouting orders, screaming in pain, and cheering during victories. The dialogue adds depth to the characters and the story.\r\n\r\nBattlefield Ambiance: The constant sound of gunfire, explosions, and distant artillery creates a chaotic and immersive battlefield atmosphere.\r\n\r\nMusic: The orchestral score, composed by Michael Giacchino, is both haunting and heroic. It perfectly complements the game’s emotional and action-packed moments.\r\n\r\nThe combination of sound effects and music makes every mission feel like a scene from a war movie.", "conclusion": "Call of Duty (2003) is a landmark title in the FPS genre, offering a cinematic and immersive World War II experience that still holds up today. Its engaging gameplay, realistic combat, and attention to detail set it apart from other shooters of its time. While the graphics may show their age, the game’s atmosphere, sound design, and storytelling remain timeless.\r\n\r\nFor fans of historical shooters or anyone looking to experience a piece of gaming history, Call of Duty is a must-play. It’s not just a game; it’s a tribute to the bravery and sacrifice of soldiers during WWII.", "rating": "9.0", "ano": 2003, "desenvolvedor": "Infinity Ward", "distribuidor": "Activision", "imagem": "29657250-0ec9-4084-8117-4f20ea017b63.jpg", "capa": "c3f56d4b-04fd-4556-b63e-1495dd4eccb4.jpg", "video": "https://www.youtube.com/watch?v=W5pp-hukhls", "generos": [6]}}, {"model": "core.games", "pk": 40, "fields": {"criado": "2025-02-10", "modificado": "2025-02-10", "ativo": true, "game": "Call of Duty 2", "descricao": "Call of Duty 2, developed by Infinity Ward and released in 2005, is a first-person shooter (FPS) that set a new standard for World War II-themed games. As the sequel to the critically acclaimed Call of Duty, this game builds on its predecessor's success with improved mechanics, immersive storytelling, and a gripping portrayal of historical battles. It remains a beloved classic among FPS enthusiasts and is often credited with shaping modern military shooters.", "gameplay": "Call of Duty 2 delivers intense and fast-paced gameplay that keeps players on the edge of their seats. The game features three distinct campaigns, allowing players to experience the war from the perspectives of soldiers in the Soviet Red Army, the British Army, and the United States Army. Each campaign is filled with memorable missions, from storming the beaches of Normandy to defending Stalingrad against overwhelming German forces.\r\n\r\nThe game introduces a regenerating health system, a significant departure from the traditional health pack mechanic, which adds to the fluidity and pace of combat. The AI of both allies and enemies is impressive for its time, with soldiers taking cover, throwing grenades, and providing support in realistic ways. The variety of weapons and the inclusion of vehicles in certain missions further enhance the gameplay experience.\r\n\r\nWhile the linear level design may feel restrictive compared to modern open-world shooters, it effectively creates a cinematic and focused narrative experience. The multiplayer mode, though not as advanced as today's standards, was a highlight at the time, offering hours of competitive fun.", "graphics": "For its time, Call of Duty 2 was a visual masterpiece. The game utilized the id Tech 3 engine, which was heavily modified to deliver stunning environments, realistic lighting, and detailed character models. The battlefields feel alive, with smoke, debris, and explosions adding to the chaos of war.\r\n\r\nThe attention to detail in the environments, from the snowy landscapes of Russia to the sunlit deserts of North Africa, immerses players in the historical setting. While the graphics may appear dated by today's standards, they were groundbreaking in 2005 and still hold up as a testament to the game's quality.", "sound_and_music": "The sound design in Call of Duty 2 is exceptional. The roar of gunfire, the whistle of incoming artillery, and the shouts of soldiers create an immersive audio experience that pulls players into the heat of battle. The voice acting is solid, with characters delivering believable and emotionally charged performances.\r\n\r\nThe musical score, composed by Graeme Revell, complements the game's tone perfectly. The orchestral pieces heighten the tension during intense firefights and evoke a sense of triumph during key moments. The sound and music work together to create an unforgettable atmosphere that enhances the overall experience.", "conclusion": "Call of Duty 2 is a landmark title in the FPS genre, offering a compelling mix of historical storytelling, intense gameplay, and technical excellence. While it may lack some of the features and polish of modern shooters, its impact on the gaming industry is undeniable. For fans of World War II games or FPS enthusiasts looking to revisit a classic, Call of Duty 2 remains a must-play. Its legacy continues to influence the Call of Duty franchise and the broader gaming landscape.", "rating": "9.0", "ano": 2005, "desenvolvedor": "Infinity Ward", "distribuidor": "Activision", "imagem": "64f17e6f-9ac1-4f0e-94b1-ca26d6757599.jpg", "capa": "44a12bde-8879-4e88-8772-9a5d2d0cd07e.jpg", "video": "https://www.youtube.com/watch?v=C97sdjz5b9k", "generos": [6]}}, {"model": "core.gamerating", "pk": 1, "fields": {"criado": "2024-10-06", "modificado": "2024-10-06", "ativo": true, "membro": 1, "game": 1, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 2, "fields": {"criado": "2024-10-06", "modificado": "2024-10-06", "ativo": true, "membro": 1, "game": 3, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 3, "fields": {"criado": "2024-10-07", "modificado": "2024-10-08", "ativo": true, "membro": 1, "game": 4, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 4, "fields": {"criado": "2024-10-08", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 2, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 5, "fields": {"criado": "2024-10-08", "modificado": "2024-10-08", "ativo": true, "membro": 1, "game": 5, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 6, "fields": {"criado": "2024-10-08", "modificado": "2024-10-08", "ativo": true, "membro": 5, "game": 4, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 7, "fields": {"criado": "2024-10-09", "modificado": "2024-10-13", "ativo": true, "membro": 10, "game": 7, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 8, "fields": {"criado": "2024-10-13", "modificado": "2025-02-11", "ativo": true, "membro": 10, "game": 1, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 9, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 10, "game": 11, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 10, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 10, "game": 5, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 11, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 10, "game": 8, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 12, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 10, "game": 12, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 13, "fields": {"criado": "2024-10-13", "modificado": "2025-01-04", "ativo": true, "membro": 10, "game": 2, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 14, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 1, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 15, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 11, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 16, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 2, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 17, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 7, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 18, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 5, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 19, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 8, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 20, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 12, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 21, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 9, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 22, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 3, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 23, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 10, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 24, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 14, "game": 4, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 25, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 9, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 26, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 3, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 27, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 4, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 28, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 10, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 29, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 7, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 30, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 11, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 31, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 1, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 32, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 2, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 33, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 5, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 34, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 8, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 35, "fields": {"criado": "2024-10-13", "modificado": "2024-10-13", "ativo": true, "membro": 6, "game": 12, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 36, "fields": {"criado": "2024-10-13", "modificado": "2024-10-16", "ativo": true, "membro": 5, "game": 1, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 37, "fields": {"criado": "2024-10-14", "modificado": "2024-10-14", "ativo": true, "membro": 5, "game": 9, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 38, "fields": {"criado": "2024-10-14", "modificado": "2024-10-17", "ativo": true, "membro": 5, "game": 11, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 39, "fields": {"criado": "2024-10-14", "modificado": "2024-10-14", "ativo": true, "membro": 5, "game": 3, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 40, "fields": {"criado": "2024-10-14", "modificado": "2024-10-16", "ativo": true, "membro": 5, "game": 7, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 41, "fields": {"criado": "2024-10-14", "modificado": "2024-10-14", "ativo": true, "membro": 5, "game": 10, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 42, "fields": {"criado": "2024-10-14", "modificado": "2024-10-16", "ativo": true, "membro": 5, "game": 5, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 43, "fields": {"criado": "2024-10-16", "modificado": "2024-10-16", "ativo": true, "membro": 5, "game": 8, "rating": "4.0", "favorito": false}}, {"model": "core.gamerating", "pk": 44, "fields": {"criado": "2024-10-16", "modificado": "2024-10-16", "ativo": true, "membro": 5, "game": 12, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 45, "fields": {"criado": "2024-10-16", "modificado": "2024-10-30", "ativo": true, "membro": 10, "game": 13, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 46, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 14, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 47, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 9, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 48, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 5, "game": 14, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 49, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 5, "game": 13, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 50, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 10, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 51, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 4, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 52, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 15, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 53, "fields": {"criado": "2024-10-17", "modificado": "2025-02-01", "ativo": true, "membro": 10, "game": 16, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 54, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 17, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 56, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 5, "game": 17, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 57, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 18, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 58, "fields": {"criado": "2024-10-17", "modificado": "2024-10-17", "ativo": true, "membro": 10, "game": 19, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 59, "fields": {"criado": "2024-10-18", "modificado": "2024-10-18", "ativo": true, "membro": 10, "game": 20, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 60, "fields": {"criado": "2024-10-18", "modificado": "2024-10-18", "ativo": true, "membro": 10, "game": 21, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 61, "fields": {"criado": "2024-10-25", "modificado": "2024-10-25", "ativo": true, "membro": 10, "game": 22, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 62, "fields": {"criado": "2024-10-25", "modificado": "2024-10-25", "ativo": true, "membro": 5, "game": 22, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 63, "fields": {"criado": "2024-10-25", "modificado": "2024-10-25", "ativo": true, "membro": 14, "game": 22, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 64, "fields": {"criado": "2024-10-25", "modificado": "2024-10-25", "ativo": true, "membro": 10, "game": 23, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 65, "fields": {"criado": "2024-10-31", "modificado": "2024-10-31", "ativo": true, "membro": 10, "game": 24, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 66, "fields": {"criado": "2024-11-01", "modificado": "2024-11-01", "ativo": true, "membro": 10, "game": 25, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 69, "fields": {"criado": "2024-11-03", "modificado": "2024-11-11", "ativo": true, "membro": 10, "game": 26, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 70, "fields": {"criado": "2024-11-05", "modificado": "2024-11-05", "ativo": true, "membro": 10, "game": 27, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 71, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 10, "game": 28, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 72, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 6, "game": 24, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 73, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 6, "game": 26, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 74, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 6, "game": 17, "rating": "10.0", "favorito": false}}, {"model": "core.gamerating", "pk": 75, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 6, "game": 28, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 76, "fields": {"criado": "2024-11-11", "modificado": "2024-11-11", "ativo": true, "membro": 5, "game": 28, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 77, "fields": {"criado": "2024-11-14", "modificado": "2024-11-14", "ativo": true, "membro": 10, "game": 29, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 78, "fields": {"criado": "2024-11-18", "modificado": "2024-11-18", "ativo": true, "membro": 10, "game": 30, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 79, "fields": {"criado": "2025-01-14", "modificado": "2025-01-14", "ativo": true, "membro": 10, "game": 31, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 80, "fields": {"criado": "2025-01-16", "modificado": "2025-01-16", "ativo": true, "membro": 10, "game": 32, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 81, "fields": {"criado": "2025-01-20", "modificado": "2025-01-20", "ativo": true, "membro": 10, "game": 33, "rating": "10.0", "favorito": false}}, {"model": "core.gamerating", "pk": 82, "fields": {"criado": "2025-01-21", "modificado": "2025-01-21", "ativo": true, "membro": 10, "game": 34, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 83, "fields": {"criado": "2025-01-22", "modificado": "2025-01-22", "ativo": true, "membro": 10, "game": 35, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 84, "fields": {"criado": "2025-01-27", "modificado": "2025-01-27", "ativo": true, "membro": 10, "game": 36, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 85, "fields": {"criado": "2025-01-27", "modificado": "2025-01-27", "ativo": true, "membro": 14, "game": 36, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 86, "fields": {"criado": "2025-01-27", "modificado": "2025-01-27", "ativo": true, "membro": 6, "game": 36, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 87, "fields": {"criado": "2025-01-28", "modificado": "2025-01-28", "ativo": true, "membro": 12, "game": 16, "rating": "10.0", "favorito": false}}, {"model": "core.gamerating", "pk": 88, "fields": {"criado": "2025-01-28", "modificado": "2025-01-28", "ativo": true, "membro": 13, "game": 16, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 89, "fields": {"criado": "2025-01-29", "modificado": "2025-01-29", "ativo": true, "membro": 10, "game": 37, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 90, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 38, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 91, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 39, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 92, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 10, "game": 39, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 93, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 10, "game": 38, "rating": "4.0", "favorito": false}}, {"model": "core.gamerating", "pk": 94, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 30, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 95, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 16, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 96, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 11, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 97, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 13, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 98, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 7, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 99, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 17, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 100, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 28, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 101, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 29, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 102, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 24, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 103, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 10, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 104, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 19, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 105, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 8, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 106, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 12, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 107, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 35, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 108, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 34, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 109, "fields": {"criado": "2025-02-01", "modificado": "2025-02-01", "ativo": true, "membro": 1, "game": 21, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 115, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 31, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 117, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 14, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 118, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 15, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 119, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 36, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 120, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 9, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 121, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 25, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 122, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 27, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 123, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 22, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 124, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 33, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 125, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 23, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 126, "fields": {"criado": "2025-02-02", "modificado": "2025-02-02", "ativo": true, "membro": 1, "game": 32, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 127, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 16, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 128, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 2, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 129, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 19, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 130, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 38, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 131, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 32, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 132, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 35, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 133, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 37, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 134, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 34, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 135, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 21, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 136, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 39, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 137, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 31, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 138, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 15, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 139, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 36, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 140, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 25, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 141, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 27, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 142, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 30, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 143, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 23, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 144, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 5, "game": 29, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 145, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 16, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 146, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 13, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 147, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 19, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 148, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 38, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 149, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 32, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 150, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 35, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 151, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 37, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 152, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 34, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 153, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 21, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 154, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 39, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 155, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 29, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 156, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 23, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 157, "fields": {"criado": "2025-02-03", "modificado": "2025-02-03", "ativo": true, "membro": 6, "game": 30, "rating": "10.0", "favorito": false}}, {"model": "core.gamerating", "pk": 158, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 16, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 159, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 19, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 160, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 38, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 161, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 32, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 162, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 35, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 163, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 37, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 164, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 34, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 165, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 21, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 166, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 14, "game": 39, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 167, "fields": {"criado": "2025-02-04", "modificado": "2025-02-04", "ativo": true, "membro": 10, "game": 3, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 168, "fields": {"criado": "2025-02-09", "modificado": "2025-02-09", "ativo": true, "membro": 12, "game": 30, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 169, "fields": {"criado": "2025-02-10", "modificado": "2025-02-12", "ativo": true, "membro": 1, "game": 40, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 170, "fields": {"criado": "2025-02-10", "modificado": "2025-02-10", "ativo": true, "membro": 14, "game": 40, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 171, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 14, "game": 33, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 172, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 20, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 173, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 24, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 174, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 33, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 175, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 36, "rating": "6.0", "favorito": false}}, {"model": "core.gamerating", "pk": 176, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 29, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 177, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 15, "rating": "10.0", "favorito": true}}, {"model": "core.gamerating", "pk": 178, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 12, "game": 22, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 179, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 6, "game": 15, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 180, "fields": {"criado": "2025-02-11", "modificado": "2025-02-11", "ativo": true, "membro": 1, "game": 37, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 181, "fields": {"criado": "2025-02-12", "modificado": "2025-02-12", "ativo": true, "membro": 1, "game": 26, "rating": "8.0", "favorito": false}}, {"model": "core.gamerating", "pk": 182, "fields": {"criado": "2025-02-12", "modificado": "2025-02-12", "ativo": true, "membro": 1, "game": 18, "rating": "10.0", "favorito": true}}, {"model": "core.blogpost", "pk": 2, "fields": {"titulo": "The warriors in you!", "conteudo": "Shadow Warrior is an incredible experience for me, as it perfectly blends my favorite genre, FPS, with bold action and a unique style. The mix of dark humor and over-the-top violence kept me hooked from start to finish. The fast-paced gameplay, with varied weapons and challenging enemies, still holds up today. It's definitely a game that has left a lasting mark on my journey as a shooter fan!", "imagem": "img/games/4.jpg", "autor": 10, "publicado_em": "2024-10-16T17:47:22.026Z", "atualizado_em": "2024-10-16T17:47:22.026Z"}}, {"model": "core.blogpost", "pk": 3, "fields": {"titulo": "Best FPS ever made!", "conteudo": "Quake is, in my opinion, the best FPS game ever made. Its fast-paced gameplay, revolutionary 3D graphics, and immersive atmosphere set it apart from any other game of its time. The dark, gothic world combined with its fluid multiplayer mode made it a groundbreaking experience. Even today, it remains a timeless classic for FPS fans. Quake redefined what a first-person shooter could be, and no game since has matched its sheer intensity and innovation.", "imagem": "img/games/5.jpg", "autor": 10, "publicado_em": "2024-10-16T22:51:18.286Z", "atualizado_em": "2024-10-16T22:51:18.286Z"}}, {"model": "core.blogpost", "pk": 4, "fields": {"titulo": "Star Wars in the world of PC Games", "conteudo": "Star Wars: Dark Forces, released in 1995, has a lot going for it, especially for fans of the Star Wars universe. The game succeeds in capturing the atmosphere and iconic elements from the movies, like the setting, the weapons, and the enemies, immersing players in the Star Wars world. However, despite its strengths, the gameplay feels somewhat clunky and lacks the fluidity found in other shooters of its time. While I enjoyed the storyline and the attempt to bring a cinematic experience to a first-person shooter, the awkward controls and stiff movement detracted from the overall enjoyment. It’s a good game, but the low playability holds it back from being truly great.", "imagem": "img/blog/23.jpg", "autor": 10, "publicado_em": "2024-10-17T00:16:56.390Z", "atualizado_em": "2024-10-17T00:16:56.390Z"}}, {"model": "core.blogpost", "pk": 5, "fields": {"titulo": "Great puzzle game.", "conteudo": "The Secret of Monkey Island, released in 1990 by Lucasfilm Games, is a game that perfectly blends humor, adventure, and clever puzzle-solving, making it an absolute delight for players. As Guybrush Threepwood, you embark on a whimsical journey filled with charming characters and engaging dialogue, all while striving to prove yourself as a worthy pirate.\r\n\r\nThe narrative is brilliantly crafted, filled with witty exchanges and memorable moments that keep you invested throughout the adventure. The puzzles are thoughtfully designed, encouraging exploration and creativity rather than frustration. The vibrant pixel art and catchy soundtrack by Michael Land create an immersive atmosphere that enhances the overall experience.\r\n\r\nWhat makes The Secret of Monkey Island truly special is its ability to captivate both new players and those who fondly remember it from their childhood. Its clever writing and timeless charm have secured its place as one of the greatest adventure games ever made. If you haven't experienced this classic yet, it's definitely worth diving into the enchanting world of Melee Island.", "imagem": "img/blog/7.jpg", "autor": 10, "publicado_em": "2024-10-17T10:42:30.389Z", "atualizado_em": "2024-10-17T10:43:40.273Z"}}, {"model": "core.blogpost", "pk": 7, "fields": {"titulo": "A classical strategy game!", "conteudo": "\"Close Combat: A Bridge Too Far\" is, in my opinion, one of the best strategy games ever made. Its deep tactical mechanics and realistic depiction of World War II battles create an unmatched level of immersion. The focus on soldier morale and resource management adds layers of complexity that keep the gameplay engaging. Even with its older graphics, the strategic depth and historical accuracy make it a timeless classic for any strategy enthusiast.", "imagem": "img/blog/8_A9ZJpvS.jpg", "autor": 1, "publicado_em": "2024-10-17T20:00:01.279Z", "atualizado_em": "2024-10-17T20:00:01.279Z"}}, {"model": "core.blogpost", "pk": 8, "fields": {"titulo": "Superbly! Welcome aboard.", "conteudo": "Microsoft Flight Simulator 2002 offers an immersive experience that impresses with its excellent gameplay and remarkable graphics for its time. The realistic feeling of piloting various aircraft is captivating, and the detailed scenery further enhances the authenticity of the simulation. With precise controls and a wide variety of missions, the game provides hours of enjoyment for aviation enthusiasts. It is undoubtedly a milestone in the series that continues to delight flight simulation fans.", "imagem": "img/blog/9.jpg", "autor": 10, "publicado_em": "2024-10-25T20:49:56.461Z", "atualizado_em": "2024-11-07T19:10:55.675Z"}}, {"model": "core.blogpost", "pk": 9, "fields": {"titulo": "The true spirit of a Jedi!", "conteudo": "Star Wars: Jedi Knight - Dark Forces II is a masterpiece that truly captures the essence of the Star Wars universe. It surpasses the first game, Dark Forces, in every way, especially with the addition of lightsabers and Force powers. The gameplay feels immersive, and the ability to choose between the light and dark sides adds depth to the experience. The story is engaging, and Kyle Katarn's journey as a Jedi is both compelling and exciting. The game’s visuals and level design were groundbreaking for its time, even if they feel dated today. For any Star Wars fan, this game is a must-play and a benchmark for how to translate the magic of the galaxy far, far away to the PC.", "imagem": "img/blog/10.jpg", "autor": 10, "publicado_em": "2025-01-20T17:15:42.440Z", "atualizado_em": "2025-01-20T17:15:42.440Z"}}, {"model": "core.blogcomment", "pk": 1, "fields": {"post": 3, "membro": 5, "comentario": "Quake is from far one of the best FPS ever made.", "publicado_em": "2024-10-16T23:26:49.040Z"}}, {"model": "core.blogcomment", "pk": 2, "fields": {"post": 8, "membro": 6, "comentario": "The best Flight Simulator!", "publicado_em": "2024-10-27T17:56:22.982Z"}}, {"model": "core.blogcomment", "pk": 3, "fields": {"post": 7, "membro": 6, "comentario": "One of the most realistc strategy game based in the II World War. Wonderful!", "publicado_em": "2024-10-27T18:17:11.071Z"}}, {"model": "core.blogcomment", "pk": 4, "fields": {"post": 4, "membro": 14, "comentario": "Great attempt at bringing the Star Wars vibe, although it needed a lot more to do that!", "publicado_em": "2024-10-27T18:21:00.109Z"}}, {"model": "core.blogcomment", "pk": 5, "fields": {"post": 8, "membro": 5, "comentario": "Great Flight Simulator! For me the best one.", "publicado_em": "2024-11-07T19:34:10.709Z"}}, {"model": "core.blogcomment", "pk": 6, "fields": {"post": 2, "membro": 5, "comentario": "Incredible game in FPS.", "publicado_em": "2024-11-18T15:17:03.367Z"}}, {"model": "core.tournament", "pk": 2, "fields": {"game": 30, "name": "Formula 1 - Enduro", "description": "The tournament start soon!", "start_date": "2024-12-12T18:00:00Z", "end_date": "2024-12-13T18:00:00Z", "created_by": 1, "max_participants": 5, "capa": "tournaments/capas/5.jpg", "participants": [1, 5, 10, 13, 14]}}, {"model": "core.tournament", "pk": 3, "fields": {"game": 5, "name": "QuakeWorld", "description": "For Masters of Quake World!", "start_date": "2024-12-18T18:00:00Z", "end_date": "2024-12-18T22:00:00Z", "created_by": 1, "max_participants": 8, "capa": "tournaments/capas/18.jpg", "participants": [1, 5, 14, 10]}}]